###################################
# Run the design through Encounter
###################################

## Setup design 
set designName router
source ./config/config.globals
set_message -no_limit
init_design


## Set the parameters for the floorplan (it is up to you to use these parameters or not)
################# FILL OUT PARAMETERS (OPTIONAL) #################
#set std_cell_height 3.6
#set core_width 37
#core_height should be a multiple of the std_cell_height
#set core_height 30.08
#you should iterate the core width and height to make the density close to 0.7
#set ring_left_width 3
#set ring_right_width 3 
#set ring_top_width 3
#set ring_bottom_width 3
#set ring_left_space 3 
#set ring_right_space 3
#set ring_top_space 3
#set ring_bottom_space 3
#set ring_offset 0
##################################################################


############### Create the floorplan (FILL OUT)  #################
floorPlan -d 684 630 10 10 10 10 
##################################################################
 redraw
 fit

proc connect_std_cells_to_power { } {

    globalNetConnect VDD -type tiehi -inst * -verbose
    globalNetConnect VSS -type tielo -inst * -verbose

    globalNetConnect VDD -type pgpin -pin VDD -inst * -verbose
    globalNetConnect VSS -type pgpin -pin VSS -inst * -verbose

}

Puts "#####################"
Puts "###"
Puts "### Power Routing ..."
Puts "###"
Puts "#####################"
connect_std_cells_to_power
applyGlobalNets


############## Add power rings (FILL OUT) ########################
addRing -layer {top M3 bottom M3 left M2 right M2} -spacing 1 -width 3 -nets {VDD VSS}
##################################################################
redraw


############## Route power nets (FILL OUT) #######################
sroute
##################################################################


## IO file 
#load the IO file for your pins
######### Make sure you fill out the IO file before loading ######
 loadIoFile "./$designName.io"
##################################################################
redraw

# Intermediate saving
 saveFPlan "$designName.fp"


Puts "####################"
Puts "###"
Puts "### Place Design ..."
Puts "###"
Puts "####################"
#place standard cells
 setDesignMode -process 130 -flowEffort high
# setPlaceMode -congEffort low -clkGateAware FALSE -placeIoPins FALSE
#Puts "RUNNING PLACEMENT ..."
# placeDesign  -noPrePlaceOpt

#place cells w/ timing constraints
 setTrialRouteMode -maxRouteLayer 5
 setPlaceMode -timingDriven true -congEffort high -modulePlan true
 setOptMode -fixFanoutLoad true -effort high -moveInst true -reclaimArea true
 placeDesign -inplaceOpt
connect_std_cells_to_power

#save
 redraw
 saveDesign "$designName.placed.enc"
 checkPlace
 buildTimingGraph
 redraw

Puts "###################"
Puts "###"
Puts "### Pre-Route Optimization..."
Puts "###"
Puts "###################"
 ##dont have to do this once you use -inplaceopt option in placeDesign
 #loadTimingCon "$designName.sdc"
 #setOptMode -fixFanoutLoad 
 #setOptMode -highEffort
 #setOptMode -moveInst
 #setOptMode -reclaimArea
 #optDesign -preCTS


Puts "################################"
Puts "###"
Puts "### Clock Tree Synthesis   .... "
Puts "###"
Puts "################################"
## Manual synthesis using the .cts.manual file
specifyClockTree -file "$designName.cts.manual"
setCTSMode -engine ck
ckSynthesis -clk clk -fix_added_buffers -forceReconvergent
redraw

######### Find and fill out the command to show min & max paths of the clock tree ############
## Take a screenshot of the min/max paths shown in the GUI and include it in the report

##############################################################################################

#Save design 
 saveDesign "$designName.opted.enc"
 savePlace "$designName.place"

Puts "################################"
Puts "###"
Puts "### Route critical signal first "
Puts "###"
Puts "################################"
## Unfix the clock nets to avoid routing problems
changeUseClockNetStatus -noFixedNetWires

########################## Route resetn first (FILL OUT) ###########################
 #setAttribute -net resetn
 #selectNet resetn
 #It routes just fine without these options
 
 #setNanoRouteMode 
 #setNanoRouteMode 
 #setNanoRouteMode 
 #setNanoRouteMode 
####################################################################################
 #globalDetailRoute -select resetn
 #redraw


Puts "################################"
Puts "###"
Puts "### Route other signals    .... "
Puts "###"
Puts "################################"
########################## Route All other Nets (FILL OUT) #########################
 #It routes just fine without these options
 
 #setNanoRouteMode
 #setNanoRouteMode
 #setNanoRouteMode
 #setNanoRouteMode
 #setNanoRouteMode
 #setNanoRouteMode
 #setNanoRouteMode
 #setNanoRouteMode
 #setNanoRouteMode
####################################################################################
 globalDetailRoute
 redraw

Puts "################################"
Puts "###"
Puts "### Extract and Optimization.... "
Puts "###"
Puts "################################"
#RC extraction
 setExtractRCMode -engine postRoute -effortLevel low -coupled true
 extractRC

# Optimization
 setAnalysisMode -analysisType onChipVariation
 setOptMode -yieldEffort none
 setOptMode -effort high
 setOptMode -drcMargin 0.0
 setOptMode -holdTargetSlack 0.2 -setupTargetSlack 0.0
 setOptMode -simplifyNetlist false
 setOptMode -usefulSkew false
 setOptMode -moveInst true
 setOptMode -reclaimArea true
 setOptMode -fixDRC true
 setOptMode -fixCap true
 optDesign -postRoute -hold

# Connect all new cells to VDD/GND
 globalNetConnect VDD -type pgpin -pin {VDD } -override
 globalNetConnect VSS -type pgpin -pin {VSS } -override
 globalNetConnect VDD -type tiehi
 globalNetConnect VSS -type tielo
 applyGlobalNets


## Save design 
saveDesign "$designName.routed.enc"

Puts "################################"
Puts "###"
Puts "### Add decap or fillers    .... "
Puts "###"
Puts "################################"

# Add filler cells
 verifyGeometry
 addFiller -cell FILL16TS FILL1TS FILL2TS FILL32TS FILL4TS FILL64TS FILL8TS -prefix IBM13RFLPVT_FILLER -fillBoundary
 verifyGeometry
 redraw

Puts "################################"
Puts "###"
Puts "### Verify .... "
Puts "###"
Puts "################################"
 clearDrc
 verifyGeometry
 verifyConnectivity -type regular -error 1000 -warning 50
 verifyProcessAntenna

Puts "################################"
Puts "###"
Puts "### Producing outputs    .... "
Puts "###"
Puts "################################"
#Report
 report_power -leakage -cap -nworst -pg_pin
 reportGateCount
#Output LEF
 lefOut "$designName.lef" -5.5 -PGpinLayers 4 -specifyTopLayer 4 -stripePin
#Output DEF
 set dbgLefDefOutVersion 5.5
 defOut -floorplan -netlist -routing "$designName.final.def"
#Output GDSII
 streamOut "$designName.gds" -mapFile "/tools2/courses/ee6321/share/ibm13rflpvt/mapfiles/enc2gds.map" -libName ibm13rflpvt -structureName $designName -stripes 1 -units 1000 -mode ALL
#saveNetlist -excludeLeafCell "$designName.final.v"
 saveNetlist -phys -excludeLeafCell -excludeCellInst "FILL1TS FILL2TS FILL4TS FILL8TS FILL16TS FILL32TS FILL64TS" $designName.phy.v
 saveNetlist "$designName.nophy.v" 
#Generate SDF
 extractRC -outfile "$designName.cap"
 rcOut -spef "$designName.spef"
 write_sdf "$designName.sdf"
#Report hold/setup violation
 setAnalysisMode -checkType hold -useDetailRC true
 report_timing > "$designName.hold.rpt"
 setAnalysisMode -checkType setup -useDetailRC true
 report_timing > "$designName.setup.rpt"
 reportCapViolation -outfile final_cap.tarpt
#Run DRC and Connection checks
 verifyGeometry
 verifyConnectivity -type all
 reportCritNet -outfile "$designName.critnet.rpt"

 #clearDrc
puts "**************************************"
puts "*                                    *"
puts "* And finally....                    *"
puts "*                                    *"
puts "* Encounter script finished          *"
puts "*                                    *"
puts "*                                    *"
puts "*                                    *"
puts "**************************************"

 exit
