###############################################################
#  Generated by:      Cadence Encounter 14.23-s044_1
#  OS:                Linux x86_64(Host ID cadpc05)
#  Generated on:      Thu May 16 16:16:20 2019
#  Design:            router
#  Command:           saveDesign router.routed.enc
###############################################################
current_design router
create_clock [get_ports {clk}]  -name clk -period 12.000000 -waveform {0.000000 6.000000}
set_clock_latency 0  [get_clocks {clk}]
set_clock_transition  -rise -min 1.5 [get_clocks {clk}]
set_clock_transition  -rise -max 1.5 [get_clocks {clk}]
set_clock_transition  -fall -min 1.5 [get_clocks {clk}]
set_clock_transition  -fall -max 1.5 [get_clocks {clk}]
set_propagated_clock  [get_ports {clk}]
set_max_capacitance 0.2  [get_ports {clk}]
set_max_fanout 4  [get_ports {clk}]
set_max_capacitance 0.2  [get_ports {reset}]
set_max_fanout 4  [get_ports {reset}]
set_max_capacitance 0.2  [get_ports {localRouterAddress[5]}]
set_max_fanout 4  [get_ports {localRouterAddress[5]}]
set_max_capacitance 0.2  [get_ports {localRouterAddress[4]}]
set_max_fanout 4  [get_ports {localRouterAddress[4]}]
set_max_capacitance 0.2  [get_ports {localRouterAddress[3]}]
set_max_fanout 4  [get_ports {localRouterAddress[3]}]
set_max_capacitance 0.2  [get_ports {localRouterAddress[2]}]
set_max_fanout 4  [get_ports {localRouterAddress[2]}]
set_max_capacitance 0.2  [get_ports {localRouterAddress[1]}]
set_max_fanout 4  [get_ports {localRouterAddress[1]}]
set_max_capacitance 0.2  [get_ports {localRouterAddress[0]}]
set_max_fanout 4  [get_ports {localRouterAddress[0]}]
set_max_capacitance 0.2  [get_ports {destinationAddressIn_NORTH[13]}]
set_max_fanout 4  [get_ports {destinationAddressIn_NORTH[13]}]
set_max_capacitance 0.2  [get_ports {destinationAddressIn_NORTH[12]}]
set_max_fanout 4  [get_ports {destinationAddressIn_NORTH[12]}]
set_max_capacitance 0.2  [get_ports {destinationAddressIn_NORTH[11]}]
set_max_fanout 4  [get_ports {destinationAddressIn_NORTH[11]}]
set_max_capacitance 0.2  [get_ports {destinationAddressIn_NORTH[10]}]
set_max_fanout 4  [get_ports {destinationAddressIn_NORTH[10]}]
set_max_capacitance 0.2  [get_ports {destinationAddressIn_NORTH[9]}]
set_max_fanout 4  [get_ports {destinationAddressIn_NORTH[9]}]
set_max_capacitance 0.2  [get_ports {destinationAddressIn_NORTH[8]}]
set_max_fanout 4  [get_ports {destinationAddressIn_NORTH[8]}]
set_max_capacitance 0.2  [get_ports {destinationAddressIn_NORTH[7]}]
set_max_fanout 4  [get_ports {destinationAddressIn_NORTH[7]}]
set_max_capacitance 0.2  [get_ports {destinationAddressIn_NORTH[6]}]
set_max_fanout 4  [get_ports {destinationAddressIn_NORTH[6]}]
set_max_capacitance 0.2  [get_ports {destinationAddressIn_NORTH[5]}]
set_max_fanout 4  [get_ports {destinationAddressIn_NORTH[5]}]
set_max_capacitance 0.2  [get_ports {destinationAddressIn_NORTH[4]}]
set_max_fanout 4  [get_ports {destinationAddressIn_NORTH[4]}]
set_max_capacitance 0.2  [get_ports {destinationAddressIn_NORTH[3]}]
set_max_fanout 4  [get_ports {destinationAddressIn_NORTH[3]}]
set_max_capacitance 0.2  [get_ports {destinationAddressIn_NORTH[2]}]
set_max_fanout 4  [get_ports {destinationAddressIn_NORTH[2]}]
set_max_capacitance 0.2  [get_ports {destinationAddressIn_NORTH[1]}]
set_max_fanout 4  [get_ports {destinationAddressIn_NORTH[1]}]
set_max_capacitance 0.2  [get_ports {destinationAddressIn_NORTH[0]}]
set_max_fanout 4  [get_ports {destinationAddressIn_NORTH[0]}]
set_max_capacitance 0.2  [get_ports {requesterAddressIn_NORTH[5]}]
set_max_fanout 4  [get_ports {requesterAddressIn_NORTH[5]}]
set_max_capacitance 0.2  [get_ports {requesterAddressIn_NORTH[4]}]
set_max_fanout 4  [get_ports {requesterAddressIn_NORTH[4]}]
set_max_capacitance 0.2  [get_ports {requesterAddressIn_NORTH[3]}]
set_max_fanout 4  [get_ports {requesterAddressIn_NORTH[3]}]
set_max_capacitance 0.2  [get_ports {requesterAddressIn_NORTH[2]}]
set_max_fanout 4  [get_ports {requesterAddressIn_NORTH[2]}]
set_max_capacitance 0.2  [get_ports {requesterAddressIn_NORTH[1]}]
set_max_fanout 4  [get_ports {requesterAddressIn_NORTH[1]}]
set_max_capacitance 0.2  [get_ports {requesterAddressIn_NORTH[0]}]
set_max_fanout 4  [get_ports {requesterAddressIn_NORTH[0]}]
set_max_capacitance 0.2  [get_ports {readIn_NORTH}]
set_max_fanout 4  [get_ports {readIn_NORTH}]
set_max_capacitance 0.2  [get_ports {writeIn_NORTH}]
set_max_fanout 4  [get_ports {writeIn_NORTH}]
set_max_capacitance 0.2  [get_ports {dataIn_NORTH[31]}]
set_max_fanout 4  [get_ports {dataIn_NORTH[31]}]
set_max_capacitance 0.2  [get_ports {dataIn_NORTH[30]}]
set_max_fanout 4  [get_ports {dataIn_NORTH[30]}]
set_max_capacitance 0.2  [get_ports {dataIn_NORTH[29]}]
set_max_fanout 4  [get_ports {dataIn_NORTH[29]}]
set_max_capacitance 0.2  [get_ports {dataIn_NORTH[28]}]
set_max_fanout 4  [get_ports {dataIn_NORTH[28]}]
set_max_capacitance 0.2  [get_ports {dataIn_NORTH[27]}]
set_max_fanout 4  [get_ports {dataIn_NORTH[27]}]
set_max_capacitance 0.2  [get_ports {dataIn_NORTH[26]}]
set_max_fanout 4  [get_ports {dataIn_NORTH[26]}]
set_max_capacitance 0.2  [get_ports {dataIn_NORTH[25]}]
set_max_fanout 4  [get_ports {dataIn_NORTH[25]}]
set_max_capacitance 0.2  [get_ports {dataIn_NORTH[24]}]
set_max_fanout 4  [get_ports {dataIn_NORTH[24]}]
set_max_capacitance 0.2  [get_ports {dataIn_NORTH[23]}]
set_max_fanout 4  [get_ports {dataIn_NORTH[23]}]
set_max_capacitance 0.2  [get_ports {dataIn_NORTH[22]}]
set_max_fanout 4  [get_ports {dataIn_NORTH[22]}]
set_max_capacitance 0.2  [get_ports {dataIn_NORTH[21]}]
set_max_fanout 4  [get_ports {dataIn_NORTH[21]}]
set_max_capacitance 0.2  [get_ports {dataIn_NORTH[20]}]
set_max_fanout 4  [get_ports {dataIn_NORTH[20]}]
set_max_capacitance 0.2  [get_ports {dataIn_NORTH[19]}]
set_max_fanout 4  [get_ports {dataIn_NORTH[19]}]
set_max_capacitance 0.2  [get_ports {dataIn_NORTH[18]}]
set_max_fanout 4  [get_ports {dataIn_NORTH[18]}]
set_max_capacitance 0.2  [get_ports {dataIn_NORTH[17]}]
set_max_fanout 4  [get_ports {dataIn_NORTH[17]}]
set_max_capacitance 0.2  [get_ports {dataIn_NORTH[16]}]
set_max_fanout 4  [get_ports {dataIn_NORTH[16]}]
set_max_capacitance 0.2  [get_ports {dataIn_NORTH[15]}]
set_max_fanout 4  [get_ports {dataIn_NORTH[15]}]
set_max_capacitance 0.2  [get_ports {dataIn_NORTH[14]}]
set_max_fanout 4  [get_ports {dataIn_NORTH[14]}]
set_max_capacitance 0.2  [get_ports {dataIn_NORTH[13]}]
set_max_fanout 4  [get_ports {dataIn_NORTH[13]}]
set_max_capacitance 0.2  [get_ports {dataIn_NORTH[12]}]
set_max_fanout 4  [get_ports {dataIn_NORTH[12]}]
set_max_capacitance 0.2  [get_ports {dataIn_NORTH[11]}]
set_max_fanout 4  [get_ports {dataIn_NORTH[11]}]
set_max_capacitance 0.2  [get_ports {dataIn_NORTH[10]}]
set_max_fanout 4  [get_ports {dataIn_NORTH[10]}]
set_max_capacitance 0.2  [get_ports {dataIn_NORTH[9]}]
set_max_fanout 4  [get_ports {dataIn_NORTH[9]}]
set_max_capacitance 0.2  [get_ports {dataIn_NORTH[8]}]
set_max_fanout 4  [get_ports {dataIn_NORTH[8]}]
set_max_capacitance 0.2  [get_ports {dataIn_NORTH[7]}]
set_max_fanout 4  [get_ports {dataIn_NORTH[7]}]
set_max_capacitance 0.2  [get_ports {dataIn_NORTH[6]}]
set_max_fanout 4  [get_ports {dataIn_NORTH[6]}]
set_max_capacitance 0.2  [get_ports {dataIn_NORTH[5]}]
set_max_fanout 4  [get_ports {dataIn_NORTH[5]}]
set_max_capacitance 0.2  [get_ports {dataIn_NORTH[4]}]
set_max_fanout 4  [get_ports {dataIn_NORTH[4]}]
set_max_capacitance 0.2  [get_ports {dataIn_NORTH[3]}]
set_max_fanout 4  [get_ports {dataIn_NORTH[3]}]
set_max_capacitance 0.2  [get_ports {dataIn_NORTH[2]}]
set_max_fanout 4  [get_ports {dataIn_NORTH[2]}]
set_max_capacitance 0.2  [get_ports {dataIn_NORTH[1]}]
set_max_fanout 4  [get_ports {dataIn_NORTH[1]}]
set_max_capacitance 0.2  [get_ports {dataIn_NORTH[0]}]
set_max_fanout 4  [get_ports {dataIn_NORTH[0]}]
set_load -pin_load -max  0.005  [get_ports {destinationAddressOut_NORTH[13]}]
set_load -pin_load -min  0.005  [get_ports {destinationAddressOut_NORTH[13]}]
set_load -pin_load -max  0.005  [get_ports {destinationAddressOut_NORTH[12]}]
set_load -pin_load -min  0.005  [get_ports {destinationAddressOut_NORTH[12]}]
set_load -pin_load -max  0.005  [get_ports {destinationAddressOut_NORTH[11]}]
set_load -pin_load -min  0.005  [get_ports {destinationAddressOut_NORTH[11]}]
set_load -pin_load -max  0.005  [get_ports {destinationAddressOut_NORTH[10]}]
set_load -pin_load -min  0.005  [get_ports {destinationAddressOut_NORTH[10]}]
set_load -pin_load -max  0.005  [get_ports {destinationAddressOut_NORTH[9]}]
set_load -pin_load -min  0.005  [get_ports {destinationAddressOut_NORTH[9]}]
set_load -pin_load -max  0.005  [get_ports {destinationAddressOut_NORTH[8]}]
set_load -pin_load -min  0.005  [get_ports {destinationAddressOut_NORTH[8]}]
set_load -pin_load -max  0.005  [get_ports {destinationAddressOut_NORTH[7]}]
set_load -pin_load -min  0.005  [get_ports {destinationAddressOut_NORTH[7]}]
set_load -pin_load -max  0.005  [get_ports {destinationAddressOut_NORTH[6]}]
set_load -pin_load -min  0.005  [get_ports {destinationAddressOut_NORTH[6]}]
set_load -pin_load -max  0.005  [get_ports {destinationAddressOut_NORTH[5]}]
set_load -pin_load -min  0.005  [get_ports {destinationAddressOut_NORTH[5]}]
set_load -pin_load -max  0.005  [get_ports {destinationAddressOut_NORTH[4]}]
set_load -pin_load -min  0.005  [get_ports {destinationAddressOut_NORTH[4]}]
set_load -pin_load -max  0.005  [get_ports {destinationAddressOut_NORTH[3]}]
set_load -pin_load -min  0.005  [get_ports {destinationAddressOut_NORTH[3]}]
set_load -pin_load -max  0.005  [get_ports {destinationAddressOut_NORTH[2]}]
set_load -pin_load -min  0.005  [get_ports {destinationAddressOut_NORTH[2]}]
set_load -pin_load -max  0.005  [get_ports {destinationAddressOut_NORTH[1]}]
set_load -pin_load -min  0.005  [get_ports {destinationAddressOut_NORTH[1]}]
set_load -pin_load -max  0.005  [get_ports {destinationAddressOut_NORTH[0]}]
set_load -pin_load -min  0.005  [get_ports {destinationAddressOut_NORTH[0]}]
set_load -pin_load -max  0.005  [get_ports {requesterAddressOut_NORTH[5]}]
set_load -pin_load -min  0.005  [get_ports {requesterAddressOut_NORTH[5]}]
set_load -pin_load -max  0.005  [get_ports {requesterAddressOut_NORTH[4]}]
set_load -pin_load -min  0.005  [get_ports {requesterAddressOut_NORTH[4]}]
set_load -pin_load -max  0.005  [get_ports {requesterAddressOut_NORTH[3]}]
set_load -pin_load -min  0.005  [get_ports {requesterAddressOut_NORTH[3]}]
set_load -pin_load -max  0.005  [get_ports {requesterAddressOut_NORTH[2]}]
set_load -pin_load -min  0.005  [get_ports {requesterAddressOut_NORTH[2]}]
set_load -pin_load -max  0.005  [get_ports {requesterAddressOut_NORTH[1]}]
set_load -pin_load -min  0.005  [get_ports {requesterAddressOut_NORTH[1]}]
set_load -pin_load -max  0.005  [get_ports {requesterAddressOut_NORTH[0]}]
set_load -pin_load -min  0.005  [get_ports {requesterAddressOut_NORTH[0]}]
set_load -pin_load -max  0.005  [get_ports {readOut_NORTH}]
set_load -pin_load -min  0.005  [get_ports {readOut_NORTH}]
set_load -pin_load -max  0.005  [get_ports {writeOut_NORTH}]
set_load -pin_load -min  0.005  [get_ports {writeOut_NORTH}]
set_load -pin_load -max  0.005  [get_ports {dataOut_NORTH[31]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_NORTH[31]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_NORTH[30]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_NORTH[30]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_NORTH[29]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_NORTH[29]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_NORTH[28]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_NORTH[28]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_NORTH[27]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_NORTH[27]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_NORTH[26]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_NORTH[26]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_NORTH[25]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_NORTH[25]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_NORTH[24]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_NORTH[24]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_NORTH[23]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_NORTH[23]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_NORTH[22]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_NORTH[22]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_NORTH[21]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_NORTH[21]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_NORTH[20]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_NORTH[20]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_NORTH[19]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_NORTH[19]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_NORTH[18]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_NORTH[18]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_NORTH[17]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_NORTH[17]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_NORTH[16]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_NORTH[16]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_NORTH[15]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_NORTH[15]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_NORTH[14]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_NORTH[14]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_NORTH[13]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_NORTH[13]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_NORTH[12]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_NORTH[12]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_NORTH[11]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_NORTH[11]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_NORTH[10]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_NORTH[10]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_NORTH[9]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_NORTH[9]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_NORTH[8]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_NORTH[8]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_NORTH[7]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_NORTH[7]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_NORTH[6]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_NORTH[6]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_NORTH[5]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_NORTH[5]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_NORTH[4]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_NORTH[4]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_NORTH[3]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_NORTH[3]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_NORTH[2]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_NORTH[2]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_NORTH[1]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_NORTH[1]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_NORTH[0]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_NORTH[0]}]
set_max_capacitance 0.2  [get_ports {destinationAddressIn_SOUTH[13]}]
set_max_fanout 4  [get_ports {destinationAddressIn_SOUTH[13]}]
set_max_capacitance 0.2  [get_ports {destinationAddressIn_SOUTH[12]}]
set_max_fanout 4  [get_ports {destinationAddressIn_SOUTH[12]}]
set_max_capacitance 0.2  [get_ports {destinationAddressIn_SOUTH[11]}]
set_max_fanout 4  [get_ports {destinationAddressIn_SOUTH[11]}]
set_max_capacitance 0.2  [get_ports {destinationAddressIn_SOUTH[10]}]
set_max_fanout 4  [get_ports {destinationAddressIn_SOUTH[10]}]
set_max_capacitance 0.2  [get_ports {destinationAddressIn_SOUTH[9]}]
set_max_fanout 4  [get_ports {destinationAddressIn_SOUTH[9]}]
set_max_capacitance 0.2  [get_ports {destinationAddressIn_SOUTH[8]}]
set_max_fanout 4  [get_ports {destinationAddressIn_SOUTH[8]}]
set_max_capacitance 0.2  [get_ports {destinationAddressIn_SOUTH[7]}]
set_max_fanout 4  [get_ports {destinationAddressIn_SOUTH[7]}]
set_max_capacitance 0.2  [get_ports {destinationAddressIn_SOUTH[6]}]
set_max_fanout 4  [get_ports {destinationAddressIn_SOUTH[6]}]
set_max_capacitance 0.2  [get_ports {destinationAddressIn_SOUTH[5]}]
set_max_fanout 4  [get_ports {destinationAddressIn_SOUTH[5]}]
set_max_capacitance 0.2  [get_ports {destinationAddressIn_SOUTH[4]}]
set_max_fanout 4  [get_ports {destinationAddressIn_SOUTH[4]}]
set_max_capacitance 0.2  [get_ports {destinationAddressIn_SOUTH[3]}]
set_max_fanout 4  [get_ports {destinationAddressIn_SOUTH[3]}]
set_max_capacitance 0.2  [get_ports {destinationAddressIn_SOUTH[2]}]
set_max_fanout 4  [get_ports {destinationAddressIn_SOUTH[2]}]
set_max_capacitance 0.2  [get_ports {destinationAddressIn_SOUTH[1]}]
set_max_fanout 4  [get_ports {destinationAddressIn_SOUTH[1]}]
set_max_capacitance 0.2  [get_ports {destinationAddressIn_SOUTH[0]}]
set_max_fanout 4  [get_ports {destinationAddressIn_SOUTH[0]}]
set_max_capacitance 0.2  [get_ports {requesterAddressIn_SOUTH[5]}]
set_max_fanout 4  [get_ports {requesterAddressIn_SOUTH[5]}]
set_max_capacitance 0.2  [get_ports {requesterAddressIn_SOUTH[4]}]
set_max_fanout 4  [get_ports {requesterAddressIn_SOUTH[4]}]
set_max_capacitance 0.2  [get_ports {requesterAddressIn_SOUTH[3]}]
set_max_fanout 4  [get_ports {requesterAddressIn_SOUTH[3]}]
set_max_capacitance 0.2  [get_ports {requesterAddressIn_SOUTH[2]}]
set_max_fanout 4  [get_ports {requesterAddressIn_SOUTH[2]}]
set_max_capacitance 0.2  [get_ports {requesterAddressIn_SOUTH[1]}]
set_max_fanout 4  [get_ports {requesterAddressIn_SOUTH[1]}]
set_max_capacitance 0.2  [get_ports {requesterAddressIn_SOUTH[0]}]
set_max_fanout 4  [get_ports {requesterAddressIn_SOUTH[0]}]
set_max_capacitance 0.2  [get_ports {readIn_SOUTH}]
set_max_fanout 4  [get_ports {readIn_SOUTH}]
set_max_capacitance 0.2  [get_ports {writeIn_SOUTH}]
set_max_fanout 4  [get_ports {writeIn_SOUTH}]
set_max_capacitance 0.2  [get_ports {dataIn_SOUTH[31]}]
set_max_fanout 4  [get_ports {dataIn_SOUTH[31]}]
set_max_capacitance 0.2  [get_ports {dataIn_SOUTH[30]}]
set_max_fanout 4  [get_ports {dataIn_SOUTH[30]}]
set_max_capacitance 0.2  [get_ports {dataIn_SOUTH[29]}]
set_max_fanout 4  [get_ports {dataIn_SOUTH[29]}]
set_max_capacitance 0.2  [get_ports {dataIn_SOUTH[28]}]
set_max_fanout 4  [get_ports {dataIn_SOUTH[28]}]
set_max_capacitance 0.2  [get_ports {dataIn_SOUTH[27]}]
set_max_fanout 4  [get_ports {dataIn_SOUTH[27]}]
set_max_capacitance 0.2  [get_ports {dataIn_SOUTH[26]}]
set_max_fanout 4  [get_ports {dataIn_SOUTH[26]}]
set_max_capacitance 0.2  [get_ports {dataIn_SOUTH[25]}]
set_max_fanout 4  [get_ports {dataIn_SOUTH[25]}]
set_max_capacitance 0.2  [get_ports {dataIn_SOUTH[24]}]
set_max_fanout 4  [get_ports {dataIn_SOUTH[24]}]
set_max_capacitance 0.2  [get_ports {dataIn_SOUTH[23]}]
set_max_fanout 4  [get_ports {dataIn_SOUTH[23]}]
set_max_capacitance 0.2  [get_ports {dataIn_SOUTH[22]}]
set_max_fanout 4  [get_ports {dataIn_SOUTH[22]}]
set_max_capacitance 0.2  [get_ports {dataIn_SOUTH[21]}]
set_max_fanout 4  [get_ports {dataIn_SOUTH[21]}]
set_max_capacitance 0.2  [get_ports {dataIn_SOUTH[20]}]
set_max_fanout 4  [get_ports {dataIn_SOUTH[20]}]
set_max_capacitance 0.2  [get_ports {dataIn_SOUTH[19]}]
set_max_fanout 4  [get_ports {dataIn_SOUTH[19]}]
set_max_capacitance 0.2  [get_ports {dataIn_SOUTH[18]}]
set_max_fanout 4  [get_ports {dataIn_SOUTH[18]}]
set_max_capacitance 0.2  [get_ports {dataIn_SOUTH[17]}]
set_max_fanout 4  [get_ports {dataIn_SOUTH[17]}]
set_max_capacitance 0.2  [get_ports {dataIn_SOUTH[16]}]
set_max_fanout 4  [get_ports {dataIn_SOUTH[16]}]
set_max_capacitance 0.2  [get_ports {dataIn_SOUTH[15]}]
set_max_fanout 4  [get_ports {dataIn_SOUTH[15]}]
set_max_capacitance 0.2  [get_ports {dataIn_SOUTH[14]}]
set_max_fanout 4  [get_ports {dataIn_SOUTH[14]}]
set_max_capacitance 0.2  [get_ports {dataIn_SOUTH[13]}]
set_max_fanout 4  [get_ports {dataIn_SOUTH[13]}]
set_max_capacitance 0.2  [get_ports {dataIn_SOUTH[12]}]
set_max_fanout 4  [get_ports {dataIn_SOUTH[12]}]
set_max_capacitance 0.2  [get_ports {dataIn_SOUTH[11]}]
set_max_fanout 4  [get_ports {dataIn_SOUTH[11]}]
set_max_capacitance 0.2  [get_ports {dataIn_SOUTH[10]}]
set_max_fanout 4  [get_ports {dataIn_SOUTH[10]}]
set_max_capacitance 0.2  [get_ports {dataIn_SOUTH[9]}]
set_max_fanout 4  [get_ports {dataIn_SOUTH[9]}]
set_max_capacitance 0.2  [get_ports {dataIn_SOUTH[8]}]
set_max_fanout 4  [get_ports {dataIn_SOUTH[8]}]
set_max_capacitance 0.2  [get_ports {dataIn_SOUTH[7]}]
set_max_fanout 4  [get_ports {dataIn_SOUTH[7]}]
set_max_capacitance 0.2  [get_ports {dataIn_SOUTH[6]}]
set_max_fanout 4  [get_ports {dataIn_SOUTH[6]}]
set_max_capacitance 0.2  [get_ports {dataIn_SOUTH[5]}]
set_max_fanout 4  [get_ports {dataIn_SOUTH[5]}]
set_max_capacitance 0.2  [get_ports {dataIn_SOUTH[4]}]
set_max_fanout 4  [get_ports {dataIn_SOUTH[4]}]
set_max_capacitance 0.2  [get_ports {dataIn_SOUTH[3]}]
set_max_fanout 4  [get_ports {dataIn_SOUTH[3]}]
set_max_capacitance 0.2  [get_ports {dataIn_SOUTH[2]}]
set_max_fanout 4  [get_ports {dataIn_SOUTH[2]}]
set_max_capacitance 0.2  [get_ports {dataIn_SOUTH[1]}]
set_max_fanout 4  [get_ports {dataIn_SOUTH[1]}]
set_max_capacitance 0.2  [get_ports {dataIn_SOUTH[0]}]
set_max_fanout 4  [get_ports {dataIn_SOUTH[0]}]
set_load -pin_load -max  0.005  [get_ports {destinationAddressOut_SOUTH[13]}]
set_load -pin_load -min  0.005  [get_ports {destinationAddressOut_SOUTH[13]}]
set_load -pin_load -max  0.005  [get_ports {destinationAddressOut_SOUTH[12]}]
set_load -pin_load -min  0.005  [get_ports {destinationAddressOut_SOUTH[12]}]
set_load -pin_load -max  0.005  [get_ports {destinationAddressOut_SOUTH[11]}]
set_load -pin_load -min  0.005  [get_ports {destinationAddressOut_SOUTH[11]}]
set_load -pin_load -max  0.005  [get_ports {destinationAddressOut_SOUTH[10]}]
set_load -pin_load -min  0.005  [get_ports {destinationAddressOut_SOUTH[10]}]
set_load -pin_load -max  0.005  [get_ports {destinationAddressOut_SOUTH[9]}]
set_load -pin_load -min  0.005  [get_ports {destinationAddressOut_SOUTH[9]}]
set_load -pin_load -max  0.005  [get_ports {destinationAddressOut_SOUTH[8]}]
set_load -pin_load -min  0.005  [get_ports {destinationAddressOut_SOUTH[8]}]
set_load -pin_load -max  0.005  [get_ports {destinationAddressOut_SOUTH[7]}]
set_load -pin_load -min  0.005  [get_ports {destinationAddressOut_SOUTH[7]}]
set_load -pin_load -max  0.005  [get_ports {destinationAddressOut_SOUTH[6]}]
set_load -pin_load -min  0.005  [get_ports {destinationAddressOut_SOUTH[6]}]
set_load -pin_load -max  0.005  [get_ports {destinationAddressOut_SOUTH[5]}]
set_load -pin_load -min  0.005  [get_ports {destinationAddressOut_SOUTH[5]}]
set_load -pin_load -max  0.005  [get_ports {destinationAddressOut_SOUTH[4]}]
set_load -pin_load -min  0.005  [get_ports {destinationAddressOut_SOUTH[4]}]
set_load -pin_load -max  0.005  [get_ports {destinationAddressOut_SOUTH[3]}]
set_load -pin_load -min  0.005  [get_ports {destinationAddressOut_SOUTH[3]}]
set_load -pin_load -max  0.005  [get_ports {destinationAddressOut_SOUTH[2]}]
set_load -pin_load -min  0.005  [get_ports {destinationAddressOut_SOUTH[2]}]
set_load -pin_load -max  0.005  [get_ports {destinationAddressOut_SOUTH[1]}]
set_load -pin_load -min  0.005  [get_ports {destinationAddressOut_SOUTH[1]}]
set_load -pin_load -max  0.005  [get_ports {destinationAddressOut_SOUTH[0]}]
set_load -pin_load -min  0.005  [get_ports {destinationAddressOut_SOUTH[0]}]
set_load -pin_load -max  0.005  [get_ports {requesterAddressOut_SOUTH[5]}]
set_load -pin_load -min  0.005  [get_ports {requesterAddressOut_SOUTH[5]}]
set_load -pin_load -max  0.005  [get_ports {requesterAddressOut_SOUTH[4]}]
set_load -pin_load -min  0.005  [get_ports {requesterAddressOut_SOUTH[4]}]
set_load -pin_load -max  0.005  [get_ports {requesterAddressOut_SOUTH[3]}]
set_load -pin_load -min  0.005  [get_ports {requesterAddressOut_SOUTH[3]}]
set_load -pin_load -max  0.005  [get_ports {requesterAddressOut_SOUTH[2]}]
set_load -pin_load -min  0.005  [get_ports {requesterAddressOut_SOUTH[2]}]
set_load -pin_load -max  0.005  [get_ports {requesterAddressOut_SOUTH[1]}]
set_load -pin_load -min  0.005  [get_ports {requesterAddressOut_SOUTH[1]}]
set_load -pin_load -max  0.005  [get_ports {requesterAddressOut_SOUTH[0]}]
set_load -pin_load -min  0.005  [get_ports {requesterAddressOut_SOUTH[0]}]
set_load -pin_load -max  0.005  [get_ports {readOut_SOUTH}]
set_load -pin_load -min  0.005  [get_ports {readOut_SOUTH}]
set_load -pin_load -max  0.005  [get_ports {writeOut_SOUTH}]
set_load -pin_load -min  0.005  [get_ports {writeOut_SOUTH}]
set_load -pin_load -max  0.005  [get_ports {dataOut_SOUTH[31]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_SOUTH[31]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_SOUTH[30]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_SOUTH[30]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_SOUTH[29]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_SOUTH[29]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_SOUTH[28]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_SOUTH[28]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_SOUTH[27]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_SOUTH[27]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_SOUTH[26]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_SOUTH[26]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_SOUTH[25]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_SOUTH[25]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_SOUTH[24]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_SOUTH[24]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_SOUTH[23]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_SOUTH[23]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_SOUTH[22]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_SOUTH[22]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_SOUTH[21]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_SOUTH[21]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_SOUTH[20]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_SOUTH[20]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_SOUTH[19]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_SOUTH[19]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_SOUTH[18]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_SOUTH[18]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_SOUTH[17]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_SOUTH[17]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_SOUTH[16]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_SOUTH[16]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_SOUTH[15]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_SOUTH[15]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_SOUTH[14]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_SOUTH[14]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_SOUTH[13]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_SOUTH[13]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_SOUTH[12]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_SOUTH[12]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_SOUTH[11]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_SOUTH[11]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_SOUTH[10]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_SOUTH[10]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_SOUTH[9]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_SOUTH[9]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_SOUTH[8]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_SOUTH[8]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_SOUTH[7]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_SOUTH[7]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_SOUTH[6]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_SOUTH[6]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_SOUTH[5]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_SOUTH[5]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_SOUTH[4]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_SOUTH[4]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_SOUTH[3]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_SOUTH[3]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_SOUTH[2]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_SOUTH[2]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_SOUTH[1]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_SOUTH[1]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_SOUTH[0]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_SOUTH[0]}]
set_max_capacitance 0.2  [get_ports {destinationAddressIn_EAST[13]}]
set_max_fanout 4  [get_ports {destinationAddressIn_EAST[13]}]
set_max_capacitance 0.2  [get_ports {destinationAddressIn_EAST[12]}]
set_max_fanout 4  [get_ports {destinationAddressIn_EAST[12]}]
set_max_capacitance 0.2  [get_ports {destinationAddressIn_EAST[11]}]
set_max_fanout 4  [get_ports {destinationAddressIn_EAST[11]}]
set_max_capacitance 0.2  [get_ports {destinationAddressIn_EAST[10]}]
set_max_fanout 4  [get_ports {destinationAddressIn_EAST[10]}]
set_max_capacitance 0.2  [get_ports {destinationAddressIn_EAST[9]}]
set_max_fanout 4  [get_ports {destinationAddressIn_EAST[9]}]
set_max_capacitance 0.2  [get_ports {destinationAddressIn_EAST[8]}]
set_max_fanout 4  [get_ports {destinationAddressIn_EAST[8]}]
set_max_capacitance 0.2  [get_ports {destinationAddressIn_EAST[7]}]
set_max_fanout 4  [get_ports {destinationAddressIn_EAST[7]}]
set_max_capacitance 0.2  [get_ports {destinationAddressIn_EAST[6]}]
set_max_fanout 4  [get_ports {destinationAddressIn_EAST[6]}]
set_max_capacitance 0.2  [get_ports {destinationAddressIn_EAST[5]}]
set_max_fanout 4  [get_ports {destinationAddressIn_EAST[5]}]
set_max_capacitance 0.2  [get_ports {destinationAddressIn_EAST[4]}]
set_max_fanout 4  [get_ports {destinationAddressIn_EAST[4]}]
set_max_capacitance 0.2  [get_ports {destinationAddressIn_EAST[3]}]
set_max_fanout 4  [get_ports {destinationAddressIn_EAST[3]}]
set_max_capacitance 0.2  [get_ports {destinationAddressIn_EAST[2]}]
set_max_fanout 4  [get_ports {destinationAddressIn_EAST[2]}]
set_max_capacitance 0.2  [get_ports {destinationAddressIn_EAST[1]}]
set_max_fanout 4  [get_ports {destinationAddressIn_EAST[1]}]
set_max_capacitance 0.2  [get_ports {destinationAddressIn_EAST[0]}]
set_max_fanout 4  [get_ports {destinationAddressIn_EAST[0]}]
set_max_capacitance 0.2  [get_ports {requesterAddressIn_EAST[5]}]
set_max_fanout 4  [get_ports {requesterAddressIn_EAST[5]}]
set_max_capacitance 0.2  [get_ports {requesterAddressIn_EAST[4]}]
set_max_fanout 4  [get_ports {requesterAddressIn_EAST[4]}]
set_max_capacitance 0.2  [get_ports {requesterAddressIn_EAST[3]}]
set_max_fanout 4  [get_ports {requesterAddressIn_EAST[3]}]
set_max_capacitance 0.2  [get_ports {requesterAddressIn_EAST[2]}]
set_max_fanout 4  [get_ports {requesterAddressIn_EAST[2]}]
set_max_capacitance 0.2  [get_ports {requesterAddressIn_EAST[1]}]
set_max_fanout 4  [get_ports {requesterAddressIn_EAST[1]}]
set_max_capacitance 0.2  [get_ports {requesterAddressIn_EAST[0]}]
set_max_fanout 4  [get_ports {requesterAddressIn_EAST[0]}]
set_max_capacitance 0.2  [get_ports {readIn_EAST}]
set_max_fanout 4  [get_ports {readIn_EAST}]
set_max_capacitance 0.2  [get_ports {writeIn_EAST}]
set_max_fanout 4  [get_ports {writeIn_EAST}]
set_max_capacitance 0.2  [get_ports {dataIn_EAST[31]}]
set_max_fanout 4  [get_ports {dataIn_EAST[31]}]
set_max_capacitance 0.2  [get_ports {dataIn_EAST[30]}]
set_max_fanout 4  [get_ports {dataIn_EAST[30]}]
set_max_capacitance 0.2  [get_ports {dataIn_EAST[29]}]
set_max_fanout 4  [get_ports {dataIn_EAST[29]}]
set_max_capacitance 0.2  [get_ports {dataIn_EAST[28]}]
set_max_fanout 4  [get_ports {dataIn_EAST[28]}]
set_max_capacitance 0.2  [get_ports {dataIn_EAST[27]}]
set_max_fanout 4  [get_ports {dataIn_EAST[27]}]
set_max_capacitance 0.2  [get_ports {dataIn_EAST[26]}]
set_max_fanout 4  [get_ports {dataIn_EAST[26]}]
set_max_capacitance 0.2  [get_ports {dataIn_EAST[25]}]
set_max_fanout 4  [get_ports {dataIn_EAST[25]}]
set_max_capacitance 0.2  [get_ports {dataIn_EAST[24]}]
set_max_fanout 4  [get_ports {dataIn_EAST[24]}]
set_max_capacitance 0.2  [get_ports {dataIn_EAST[23]}]
set_max_fanout 4  [get_ports {dataIn_EAST[23]}]
set_max_capacitance 0.2  [get_ports {dataIn_EAST[22]}]
set_max_fanout 4  [get_ports {dataIn_EAST[22]}]
set_max_capacitance 0.2  [get_ports {dataIn_EAST[21]}]
set_max_fanout 4  [get_ports {dataIn_EAST[21]}]
set_max_capacitance 0.2  [get_ports {dataIn_EAST[20]}]
set_max_fanout 4  [get_ports {dataIn_EAST[20]}]
set_max_capacitance 0.2  [get_ports {dataIn_EAST[19]}]
set_max_fanout 4  [get_ports {dataIn_EAST[19]}]
set_max_capacitance 0.2  [get_ports {dataIn_EAST[18]}]
set_max_fanout 4  [get_ports {dataIn_EAST[18]}]
set_max_capacitance 0.2  [get_ports {dataIn_EAST[17]}]
set_max_fanout 4  [get_ports {dataIn_EAST[17]}]
set_max_capacitance 0.2  [get_ports {dataIn_EAST[16]}]
set_max_fanout 4  [get_ports {dataIn_EAST[16]}]
set_max_capacitance 0.2  [get_ports {dataIn_EAST[15]}]
set_max_fanout 4  [get_ports {dataIn_EAST[15]}]
set_max_capacitance 0.2  [get_ports {dataIn_EAST[14]}]
set_max_fanout 4  [get_ports {dataIn_EAST[14]}]
set_max_capacitance 0.2  [get_ports {dataIn_EAST[13]}]
set_max_fanout 4  [get_ports {dataIn_EAST[13]}]
set_max_capacitance 0.2  [get_ports {dataIn_EAST[12]}]
set_max_fanout 4  [get_ports {dataIn_EAST[12]}]
set_max_capacitance 0.2  [get_ports {dataIn_EAST[11]}]
set_max_fanout 4  [get_ports {dataIn_EAST[11]}]
set_max_capacitance 0.2  [get_ports {dataIn_EAST[10]}]
set_max_fanout 4  [get_ports {dataIn_EAST[10]}]
set_max_capacitance 0.2  [get_ports {dataIn_EAST[9]}]
set_max_fanout 4  [get_ports {dataIn_EAST[9]}]
set_max_capacitance 0.2  [get_ports {dataIn_EAST[8]}]
set_max_fanout 4  [get_ports {dataIn_EAST[8]}]
set_max_capacitance 0.2  [get_ports {dataIn_EAST[7]}]
set_max_fanout 4  [get_ports {dataIn_EAST[7]}]
set_max_capacitance 0.2  [get_ports {dataIn_EAST[6]}]
set_max_fanout 4  [get_ports {dataIn_EAST[6]}]
set_max_capacitance 0.2  [get_ports {dataIn_EAST[5]}]
set_max_fanout 4  [get_ports {dataIn_EAST[5]}]
set_max_capacitance 0.2  [get_ports {dataIn_EAST[4]}]
set_max_fanout 4  [get_ports {dataIn_EAST[4]}]
set_max_capacitance 0.2  [get_ports {dataIn_EAST[3]}]
set_max_fanout 4  [get_ports {dataIn_EAST[3]}]
set_max_capacitance 0.2  [get_ports {dataIn_EAST[2]}]
set_max_fanout 4  [get_ports {dataIn_EAST[2]}]
set_max_capacitance 0.2  [get_ports {dataIn_EAST[1]}]
set_max_fanout 4  [get_ports {dataIn_EAST[1]}]
set_max_capacitance 0.2  [get_ports {dataIn_EAST[0]}]
set_max_fanout 4  [get_ports {dataIn_EAST[0]}]
set_load -pin_load -max  0.005  [get_ports {destinationAddressOut_EAST[13]}]
set_load -pin_load -min  0.005  [get_ports {destinationAddressOut_EAST[13]}]
set_load -pin_load -max  0.005  [get_ports {destinationAddressOut_EAST[12]}]
set_load -pin_load -min  0.005  [get_ports {destinationAddressOut_EAST[12]}]
set_load -pin_load -max  0.005  [get_ports {destinationAddressOut_EAST[11]}]
set_load -pin_load -min  0.005  [get_ports {destinationAddressOut_EAST[11]}]
set_load -pin_load -max  0.005  [get_ports {destinationAddressOut_EAST[10]}]
set_load -pin_load -min  0.005  [get_ports {destinationAddressOut_EAST[10]}]
set_load -pin_load -max  0.005  [get_ports {destinationAddressOut_EAST[9]}]
set_load -pin_load -min  0.005  [get_ports {destinationAddressOut_EAST[9]}]
set_load -pin_load -max  0.005  [get_ports {destinationAddressOut_EAST[8]}]
set_load -pin_load -min  0.005  [get_ports {destinationAddressOut_EAST[8]}]
set_load -pin_load -max  0.005  [get_ports {destinationAddressOut_EAST[7]}]
set_load -pin_load -min  0.005  [get_ports {destinationAddressOut_EAST[7]}]
set_load -pin_load -max  0.005  [get_ports {destinationAddressOut_EAST[6]}]
set_load -pin_load -min  0.005  [get_ports {destinationAddressOut_EAST[6]}]
set_load -pin_load -max  0.005  [get_ports {destinationAddressOut_EAST[5]}]
set_load -pin_load -min  0.005  [get_ports {destinationAddressOut_EAST[5]}]
set_load -pin_load -max  0.005  [get_ports {destinationAddressOut_EAST[4]}]
set_load -pin_load -min  0.005  [get_ports {destinationAddressOut_EAST[4]}]
set_load -pin_load -max  0.005  [get_ports {destinationAddressOut_EAST[3]}]
set_load -pin_load -min  0.005  [get_ports {destinationAddressOut_EAST[3]}]
set_load -pin_load -max  0.005  [get_ports {destinationAddressOut_EAST[2]}]
set_load -pin_load -min  0.005  [get_ports {destinationAddressOut_EAST[2]}]
set_load -pin_load -max  0.005  [get_ports {destinationAddressOut_EAST[1]}]
set_load -pin_load -min  0.005  [get_ports {destinationAddressOut_EAST[1]}]
set_load -pin_load -max  0.005  [get_ports {destinationAddressOut_EAST[0]}]
set_load -pin_load -min  0.005  [get_ports {destinationAddressOut_EAST[0]}]
set_load -pin_load -max  0.005  [get_ports {requesterAddressOut_EAST[5]}]
set_load -pin_load -min  0.005  [get_ports {requesterAddressOut_EAST[5]}]
set_load -pin_load -max  0.005  [get_ports {requesterAddressOut_EAST[4]}]
set_load -pin_load -min  0.005  [get_ports {requesterAddressOut_EAST[4]}]
set_load -pin_load -max  0.005  [get_ports {requesterAddressOut_EAST[3]}]
set_load -pin_load -min  0.005  [get_ports {requesterAddressOut_EAST[3]}]
set_load -pin_load -max  0.005  [get_ports {requesterAddressOut_EAST[2]}]
set_load -pin_load -min  0.005  [get_ports {requesterAddressOut_EAST[2]}]
set_load -pin_load -max  0.005  [get_ports {requesterAddressOut_EAST[1]}]
set_load -pin_load -min  0.005  [get_ports {requesterAddressOut_EAST[1]}]
set_load -pin_load -max  0.005  [get_ports {requesterAddressOut_EAST[0]}]
set_load -pin_load -min  0.005  [get_ports {requesterAddressOut_EAST[0]}]
set_load -pin_load -max  0.005  [get_ports {readOut_EAST}]
set_load -pin_load -min  0.005  [get_ports {readOut_EAST}]
set_load -pin_load -max  0.005  [get_ports {writeOut_EAST}]
set_load -pin_load -min  0.005  [get_ports {writeOut_EAST}]
set_load -pin_load -max  0.005  [get_ports {dataOut_EAST[31]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_EAST[31]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_EAST[30]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_EAST[30]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_EAST[29]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_EAST[29]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_EAST[28]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_EAST[28]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_EAST[27]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_EAST[27]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_EAST[26]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_EAST[26]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_EAST[25]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_EAST[25]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_EAST[24]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_EAST[24]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_EAST[23]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_EAST[23]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_EAST[22]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_EAST[22]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_EAST[21]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_EAST[21]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_EAST[20]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_EAST[20]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_EAST[19]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_EAST[19]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_EAST[18]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_EAST[18]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_EAST[17]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_EAST[17]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_EAST[16]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_EAST[16]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_EAST[15]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_EAST[15]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_EAST[14]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_EAST[14]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_EAST[13]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_EAST[13]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_EAST[12]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_EAST[12]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_EAST[11]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_EAST[11]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_EAST[10]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_EAST[10]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_EAST[9]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_EAST[9]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_EAST[8]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_EAST[8]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_EAST[7]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_EAST[7]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_EAST[6]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_EAST[6]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_EAST[5]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_EAST[5]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_EAST[4]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_EAST[4]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_EAST[3]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_EAST[3]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_EAST[2]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_EAST[2]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_EAST[1]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_EAST[1]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_EAST[0]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_EAST[0]}]
set_max_capacitance 0.2  [get_ports {destinationAddressIn_WEST[13]}]
set_max_fanout 4  [get_ports {destinationAddressIn_WEST[13]}]
set_max_capacitance 0.2  [get_ports {destinationAddressIn_WEST[12]}]
set_max_fanout 4  [get_ports {destinationAddressIn_WEST[12]}]
set_max_capacitance 0.2  [get_ports {destinationAddressIn_WEST[11]}]
set_max_fanout 4  [get_ports {destinationAddressIn_WEST[11]}]
set_max_capacitance 0.2  [get_ports {destinationAddressIn_WEST[10]}]
set_max_fanout 4  [get_ports {destinationAddressIn_WEST[10]}]
set_max_capacitance 0.2  [get_ports {destinationAddressIn_WEST[9]}]
set_max_fanout 4  [get_ports {destinationAddressIn_WEST[9]}]
set_max_capacitance 0.2  [get_ports {destinationAddressIn_WEST[8]}]
set_max_fanout 4  [get_ports {destinationAddressIn_WEST[8]}]
set_max_capacitance 0.2  [get_ports {destinationAddressIn_WEST[7]}]
set_max_fanout 4  [get_ports {destinationAddressIn_WEST[7]}]
set_max_capacitance 0.2  [get_ports {destinationAddressIn_WEST[6]}]
set_max_fanout 4  [get_ports {destinationAddressIn_WEST[6]}]
set_max_capacitance 0.2  [get_ports {destinationAddressIn_WEST[5]}]
set_max_fanout 4  [get_ports {destinationAddressIn_WEST[5]}]
set_max_capacitance 0.2  [get_ports {destinationAddressIn_WEST[4]}]
set_max_fanout 4  [get_ports {destinationAddressIn_WEST[4]}]
set_max_capacitance 0.2  [get_ports {destinationAddressIn_WEST[3]}]
set_max_fanout 4  [get_ports {destinationAddressIn_WEST[3]}]
set_max_capacitance 0.2  [get_ports {destinationAddressIn_WEST[2]}]
set_max_fanout 4  [get_ports {destinationAddressIn_WEST[2]}]
set_max_capacitance 0.2  [get_ports {destinationAddressIn_WEST[1]}]
set_max_fanout 4  [get_ports {destinationAddressIn_WEST[1]}]
set_max_capacitance 0.2  [get_ports {destinationAddressIn_WEST[0]}]
set_max_fanout 4  [get_ports {destinationAddressIn_WEST[0]}]
set_max_capacitance 0.2  [get_ports {requesterAddressIn_WEST[5]}]
set_max_fanout 4  [get_ports {requesterAddressIn_WEST[5]}]
set_max_capacitance 0.2  [get_ports {requesterAddressIn_WEST[4]}]
set_max_fanout 4  [get_ports {requesterAddressIn_WEST[4]}]
set_max_capacitance 0.2  [get_ports {requesterAddressIn_WEST[3]}]
set_max_fanout 4  [get_ports {requesterAddressIn_WEST[3]}]
set_max_capacitance 0.2  [get_ports {requesterAddressIn_WEST[2]}]
set_max_fanout 4  [get_ports {requesterAddressIn_WEST[2]}]
set_max_capacitance 0.2  [get_ports {requesterAddressIn_WEST[1]}]
set_max_fanout 4  [get_ports {requesterAddressIn_WEST[1]}]
set_max_capacitance 0.2  [get_ports {requesterAddressIn_WEST[0]}]
set_max_fanout 4  [get_ports {requesterAddressIn_WEST[0]}]
set_max_capacitance 0.2  [get_ports {readIn_WEST}]
set_max_fanout 4  [get_ports {readIn_WEST}]
set_max_capacitance 0.2  [get_ports {writeIn_WEST}]
set_max_fanout 4  [get_ports {writeIn_WEST}]
set_max_capacitance 0.2  [get_ports {dataIn_WEST[31]}]
set_max_fanout 4  [get_ports {dataIn_WEST[31]}]
set_max_capacitance 0.2  [get_ports {dataIn_WEST[30]}]
set_max_fanout 4  [get_ports {dataIn_WEST[30]}]
set_max_capacitance 0.2  [get_ports {dataIn_WEST[29]}]
set_max_fanout 4  [get_ports {dataIn_WEST[29]}]
set_max_capacitance 0.2  [get_ports {dataIn_WEST[28]}]
set_max_fanout 4  [get_ports {dataIn_WEST[28]}]
set_max_capacitance 0.2  [get_ports {dataIn_WEST[27]}]
set_max_fanout 4  [get_ports {dataIn_WEST[27]}]
set_max_capacitance 0.2  [get_ports {dataIn_WEST[26]}]
set_max_fanout 4  [get_ports {dataIn_WEST[26]}]
set_max_capacitance 0.2  [get_ports {dataIn_WEST[25]}]
set_max_fanout 4  [get_ports {dataIn_WEST[25]}]
set_max_capacitance 0.2  [get_ports {dataIn_WEST[24]}]
set_max_fanout 4  [get_ports {dataIn_WEST[24]}]
set_max_capacitance 0.2  [get_ports {dataIn_WEST[23]}]
set_max_fanout 4  [get_ports {dataIn_WEST[23]}]
set_max_capacitance 0.2  [get_ports {dataIn_WEST[22]}]
set_max_fanout 4  [get_ports {dataIn_WEST[22]}]
set_max_capacitance 0.2  [get_ports {dataIn_WEST[21]}]
set_max_fanout 4  [get_ports {dataIn_WEST[21]}]
set_max_capacitance 0.2  [get_ports {dataIn_WEST[20]}]
set_max_fanout 4  [get_ports {dataIn_WEST[20]}]
set_max_capacitance 0.2  [get_ports {dataIn_WEST[19]}]
set_max_fanout 4  [get_ports {dataIn_WEST[19]}]
set_max_capacitance 0.2  [get_ports {dataIn_WEST[18]}]
set_max_fanout 4  [get_ports {dataIn_WEST[18]}]
set_max_capacitance 0.2  [get_ports {dataIn_WEST[17]}]
set_max_fanout 4  [get_ports {dataIn_WEST[17]}]
set_max_capacitance 0.2  [get_ports {dataIn_WEST[16]}]
set_max_fanout 4  [get_ports {dataIn_WEST[16]}]
set_max_capacitance 0.2  [get_ports {dataIn_WEST[15]}]
set_max_fanout 4  [get_ports {dataIn_WEST[15]}]
set_max_capacitance 0.2  [get_ports {dataIn_WEST[14]}]
set_max_fanout 4  [get_ports {dataIn_WEST[14]}]
set_max_capacitance 0.2  [get_ports {dataIn_WEST[13]}]
set_max_fanout 4  [get_ports {dataIn_WEST[13]}]
set_max_capacitance 0.2  [get_ports {dataIn_WEST[12]}]
set_max_fanout 4  [get_ports {dataIn_WEST[12]}]
set_max_capacitance 0.2  [get_ports {dataIn_WEST[11]}]
set_max_fanout 4  [get_ports {dataIn_WEST[11]}]
set_max_capacitance 0.2  [get_ports {dataIn_WEST[10]}]
set_max_fanout 4  [get_ports {dataIn_WEST[10]}]
set_max_capacitance 0.2  [get_ports {dataIn_WEST[9]}]
set_max_fanout 4  [get_ports {dataIn_WEST[9]}]
set_max_capacitance 0.2  [get_ports {dataIn_WEST[8]}]
set_max_fanout 4  [get_ports {dataIn_WEST[8]}]
set_max_capacitance 0.2  [get_ports {dataIn_WEST[7]}]
set_max_fanout 4  [get_ports {dataIn_WEST[7]}]
set_max_capacitance 0.2  [get_ports {dataIn_WEST[6]}]
set_max_fanout 4  [get_ports {dataIn_WEST[6]}]
set_max_capacitance 0.2  [get_ports {dataIn_WEST[5]}]
set_max_fanout 4  [get_ports {dataIn_WEST[5]}]
set_max_capacitance 0.2  [get_ports {dataIn_WEST[4]}]
set_max_fanout 4  [get_ports {dataIn_WEST[4]}]
set_max_capacitance 0.2  [get_ports {dataIn_WEST[3]}]
set_max_fanout 4  [get_ports {dataIn_WEST[3]}]
set_max_capacitance 0.2  [get_ports {dataIn_WEST[2]}]
set_max_fanout 4  [get_ports {dataIn_WEST[2]}]
set_max_capacitance 0.2  [get_ports {dataIn_WEST[1]}]
set_max_fanout 4  [get_ports {dataIn_WEST[1]}]
set_max_capacitance 0.2  [get_ports {dataIn_WEST[0]}]
set_max_fanout 4  [get_ports {dataIn_WEST[0]}]
set_load -pin_load -max  0.005  [get_ports {destinationAddressOut_WEST[13]}]
set_load -pin_load -min  0.005  [get_ports {destinationAddressOut_WEST[13]}]
set_load -pin_load -max  0.005  [get_ports {destinationAddressOut_WEST[12]}]
set_load -pin_load -min  0.005  [get_ports {destinationAddressOut_WEST[12]}]
set_load -pin_load -max  0.005  [get_ports {destinationAddressOut_WEST[11]}]
set_load -pin_load -min  0.005  [get_ports {destinationAddressOut_WEST[11]}]
set_load -pin_load -max  0.005  [get_ports {destinationAddressOut_WEST[10]}]
set_load -pin_load -min  0.005  [get_ports {destinationAddressOut_WEST[10]}]
set_load -pin_load -max  0.005  [get_ports {destinationAddressOut_WEST[9]}]
set_load -pin_load -min  0.005  [get_ports {destinationAddressOut_WEST[9]}]
set_load -pin_load -max  0.005  [get_ports {destinationAddressOut_WEST[8]}]
set_load -pin_load -min  0.005  [get_ports {destinationAddressOut_WEST[8]}]
set_load -pin_load -max  0.005  [get_ports {destinationAddressOut_WEST[7]}]
set_load -pin_load -min  0.005  [get_ports {destinationAddressOut_WEST[7]}]
set_load -pin_load -max  0.005  [get_ports {destinationAddressOut_WEST[6]}]
set_load -pin_load -min  0.005  [get_ports {destinationAddressOut_WEST[6]}]
set_load -pin_load -max  0.005  [get_ports {destinationAddressOut_WEST[5]}]
set_load -pin_load -min  0.005  [get_ports {destinationAddressOut_WEST[5]}]
set_load -pin_load -max  0.005  [get_ports {destinationAddressOut_WEST[4]}]
set_load -pin_load -min  0.005  [get_ports {destinationAddressOut_WEST[4]}]
set_load -pin_load -max  0.005  [get_ports {destinationAddressOut_WEST[3]}]
set_load -pin_load -min  0.005  [get_ports {destinationAddressOut_WEST[3]}]
set_load -pin_load -max  0.005  [get_ports {destinationAddressOut_WEST[2]}]
set_load -pin_load -min  0.005  [get_ports {destinationAddressOut_WEST[2]}]
set_load -pin_load -max  0.005  [get_ports {destinationAddressOut_WEST[1]}]
set_load -pin_load -min  0.005  [get_ports {destinationAddressOut_WEST[1]}]
set_load -pin_load -max  0.005  [get_ports {destinationAddressOut_WEST[0]}]
set_load -pin_load -min  0.005  [get_ports {destinationAddressOut_WEST[0]}]
set_load -pin_load -max  0.005  [get_ports {requesterAddressOut_WEST[5]}]
set_load -pin_load -min  0.005  [get_ports {requesterAddressOut_WEST[5]}]
set_load -pin_load -max  0.005  [get_ports {requesterAddressOut_WEST[4]}]
set_load -pin_load -min  0.005  [get_ports {requesterAddressOut_WEST[4]}]
set_load -pin_load -max  0.005  [get_ports {requesterAddressOut_WEST[3]}]
set_load -pin_load -min  0.005  [get_ports {requesterAddressOut_WEST[3]}]
set_load -pin_load -max  0.005  [get_ports {requesterAddressOut_WEST[2]}]
set_load -pin_load -min  0.005  [get_ports {requesterAddressOut_WEST[2]}]
set_load -pin_load -max  0.005  [get_ports {requesterAddressOut_WEST[1]}]
set_load -pin_load -min  0.005  [get_ports {requesterAddressOut_WEST[1]}]
set_load -pin_load -max  0.005  [get_ports {requesterAddressOut_WEST[0]}]
set_load -pin_load -min  0.005  [get_ports {requesterAddressOut_WEST[0]}]
set_load -pin_load -max  0.005  [get_ports {readOut_WEST}]
set_load -pin_load -min  0.005  [get_ports {readOut_WEST}]
set_load -pin_load -max  0.005  [get_ports {writeOut_WEST}]
set_load -pin_load -min  0.005  [get_ports {writeOut_WEST}]
set_load -pin_load -max  0.005  [get_ports {dataOut_WEST[31]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_WEST[31]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_WEST[30]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_WEST[30]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_WEST[29]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_WEST[29]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_WEST[28]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_WEST[28]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_WEST[27]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_WEST[27]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_WEST[26]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_WEST[26]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_WEST[25]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_WEST[25]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_WEST[24]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_WEST[24]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_WEST[23]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_WEST[23]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_WEST[22]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_WEST[22]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_WEST[21]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_WEST[21]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_WEST[20]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_WEST[20]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_WEST[19]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_WEST[19]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_WEST[18]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_WEST[18]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_WEST[17]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_WEST[17]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_WEST[16]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_WEST[16]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_WEST[15]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_WEST[15]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_WEST[14]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_WEST[14]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_WEST[13]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_WEST[13]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_WEST[12]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_WEST[12]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_WEST[11]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_WEST[11]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_WEST[10]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_WEST[10]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_WEST[9]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_WEST[9]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_WEST[8]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_WEST[8]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_WEST[7]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_WEST[7]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_WEST[6]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_WEST[6]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_WEST[5]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_WEST[5]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_WEST[4]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_WEST[4]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_WEST[3]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_WEST[3]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_WEST[2]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_WEST[2]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_WEST[1]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_WEST[1]}]
set_load -pin_load -max  0.005  [get_ports {dataOut_WEST[0]}]
set_load -pin_load -min  0.005  [get_ports {dataOut_WEST[0]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataIn_A[31]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataIn_A[31]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataIn_A[30]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataIn_A[30]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataIn_A[29]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataIn_A[29]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataIn_A[28]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataIn_A[28]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataIn_A[27]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataIn_A[27]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataIn_A[26]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataIn_A[26]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataIn_A[25]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataIn_A[25]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataIn_A[24]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataIn_A[24]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataIn_A[23]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataIn_A[23]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataIn_A[22]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataIn_A[22]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataIn_A[21]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataIn_A[21]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataIn_A[20]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataIn_A[20]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataIn_A[19]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataIn_A[19]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataIn_A[18]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataIn_A[18]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataIn_A[17]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataIn_A[17]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataIn_A[16]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataIn_A[16]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataIn_A[15]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataIn_A[15]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataIn_A[14]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataIn_A[14]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataIn_A[13]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataIn_A[13]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataIn_A[12]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataIn_A[12]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataIn_A[11]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataIn_A[11]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataIn_A[10]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataIn_A[10]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataIn_A[9]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataIn_A[9]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataIn_A[8]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataIn_A[8]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataIn_A[7]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataIn_A[7]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataIn_A[6]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataIn_A[6]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataIn_A[5]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataIn_A[5]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataIn_A[4]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataIn_A[4]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataIn_A[3]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataIn_A[3]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataIn_A[2]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataIn_A[2]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataIn_A[1]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataIn_A[1]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataIn_A[0]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataIn_A[0]}]
set_load -pin_load -max  0.005  [get_ports {cacheAddressIn_A[7]}]
set_load -pin_load -min  0.005  [get_ports {cacheAddressIn_A[7]}]
set_load -pin_load -max  0.005  [get_ports {cacheAddressIn_A[6]}]
set_load -pin_load -min  0.005  [get_ports {cacheAddressIn_A[6]}]
set_load -pin_load -max  0.005  [get_ports {cacheAddressIn_A[5]}]
set_load -pin_load -min  0.005  [get_ports {cacheAddressIn_A[5]}]
set_load -pin_load -max  0.005  [get_ports {cacheAddressIn_A[4]}]
set_load -pin_load -min  0.005  [get_ports {cacheAddressIn_A[4]}]
set_load -pin_load -max  0.005  [get_ports {cacheAddressIn_A[3]}]
set_load -pin_load -min  0.005  [get_ports {cacheAddressIn_A[3]}]
set_load -pin_load -max  0.005  [get_ports {cacheAddressIn_A[2]}]
set_load -pin_load -min  0.005  [get_ports {cacheAddressIn_A[2]}]
set_load -pin_load -max  0.005  [get_ports {cacheAddressIn_A[1]}]
set_load -pin_load -min  0.005  [get_ports {cacheAddressIn_A[1]}]
set_load -pin_load -max  0.005  [get_ports {cacheAddressIn_A[0]}]
set_load -pin_load -min  0.005  [get_ports {cacheAddressIn_A[0]}]
set_max_capacitance 0.2  [get_ports {cacheDataOut_A[31]}]
set_max_fanout 4  [get_ports {cacheDataOut_A[31]}]
set_max_capacitance 0.2  [get_ports {cacheDataOut_A[30]}]
set_max_fanout 4  [get_ports {cacheDataOut_A[30]}]
set_max_capacitance 0.2  [get_ports {cacheDataOut_A[29]}]
set_max_fanout 4  [get_ports {cacheDataOut_A[29]}]
set_max_capacitance 0.2  [get_ports {cacheDataOut_A[28]}]
set_max_fanout 4  [get_ports {cacheDataOut_A[28]}]
set_max_capacitance 0.2  [get_ports {cacheDataOut_A[27]}]
set_max_fanout 4  [get_ports {cacheDataOut_A[27]}]
set_max_capacitance 0.2  [get_ports {cacheDataOut_A[26]}]
set_max_fanout 4  [get_ports {cacheDataOut_A[26]}]
set_max_capacitance 0.2  [get_ports {cacheDataOut_A[25]}]
set_max_fanout 4  [get_ports {cacheDataOut_A[25]}]
set_max_capacitance 0.2  [get_ports {cacheDataOut_A[24]}]
set_max_fanout 4  [get_ports {cacheDataOut_A[24]}]
set_max_capacitance 0.2  [get_ports {cacheDataOut_A[23]}]
set_max_fanout 4  [get_ports {cacheDataOut_A[23]}]
set_max_capacitance 0.2  [get_ports {cacheDataOut_A[22]}]
set_max_fanout 4  [get_ports {cacheDataOut_A[22]}]
set_max_capacitance 0.2  [get_ports {cacheDataOut_A[21]}]
set_max_fanout 4  [get_ports {cacheDataOut_A[21]}]
set_max_capacitance 0.2  [get_ports {cacheDataOut_A[20]}]
set_max_fanout 4  [get_ports {cacheDataOut_A[20]}]
set_max_capacitance 0.2  [get_ports {cacheDataOut_A[19]}]
set_max_fanout 4  [get_ports {cacheDataOut_A[19]}]
set_max_capacitance 0.2  [get_ports {cacheDataOut_A[18]}]
set_max_fanout 4  [get_ports {cacheDataOut_A[18]}]
set_max_capacitance 0.2  [get_ports {cacheDataOut_A[17]}]
set_max_fanout 4  [get_ports {cacheDataOut_A[17]}]
set_max_capacitance 0.2  [get_ports {cacheDataOut_A[16]}]
set_max_fanout 4  [get_ports {cacheDataOut_A[16]}]
set_max_capacitance 0.2  [get_ports {cacheDataOut_A[15]}]
set_max_fanout 4  [get_ports {cacheDataOut_A[15]}]
set_max_capacitance 0.2  [get_ports {cacheDataOut_A[14]}]
set_max_fanout 4  [get_ports {cacheDataOut_A[14]}]
set_max_capacitance 0.2  [get_ports {cacheDataOut_A[13]}]
set_max_fanout 4  [get_ports {cacheDataOut_A[13]}]
set_max_capacitance 0.2  [get_ports {cacheDataOut_A[12]}]
set_max_fanout 4  [get_ports {cacheDataOut_A[12]}]
set_max_capacitance 0.2  [get_ports {cacheDataOut_A[11]}]
set_max_fanout 4  [get_ports {cacheDataOut_A[11]}]
set_max_capacitance 0.2  [get_ports {cacheDataOut_A[10]}]
set_max_fanout 4  [get_ports {cacheDataOut_A[10]}]
set_max_capacitance 0.2  [get_ports {cacheDataOut_A[9]}]
set_max_fanout 4  [get_ports {cacheDataOut_A[9]}]
set_max_capacitance 0.2  [get_ports {cacheDataOut_A[8]}]
set_max_fanout 4  [get_ports {cacheDataOut_A[8]}]
set_max_capacitance 0.2  [get_ports {cacheDataOut_A[7]}]
set_max_fanout 4  [get_ports {cacheDataOut_A[7]}]
set_max_capacitance 0.2  [get_ports {cacheDataOut_A[6]}]
set_max_fanout 4  [get_ports {cacheDataOut_A[6]}]
set_max_capacitance 0.2  [get_ports {cacheDataOut_A[5]}]
set_max_fanout 4  [get_ports {cacheDataOut_A[5]}]
set_max_capacitance 0.2  [get_ports {cacheDataOut_A[4]}]
set_max_fanout 4  [get_ports {cacheDataOut_A[4]}]
set_max_capacitance 0.2  [get_ports {cacheDataOut_A[3]}]
set_max_fanout 4  [get_ports {cacheDataOut_A[3]}]
set_max_capacitance 0.2  [get_ports {cacheDataOut_A[2]}]
set_max_fanout 4  [get_ports {cacheDataOut_A[2]}]
set_max_capacitance 0.2  [get_ports {cacheDataOut_A[1]}]
set_max_fanout 4  [get_ports {cacheDataOut_A[1]}]
set_max_capacitance 0.2  [get_ports {cacheDataOut_A[0]}]
set_max_fanout 4  [get_ports {cacheDataOut_A[0]}]
set_load -pin_load -max  0.005  [get_ports {memWrite_A}]
set_load -pin_load -min  0.005  [get_ports {memWrite_A}]
set_max_capacitance 0.2  [get_ports {portA_writtenTo}]
set_max_fanout 4  [get_ports {portA_writtenTo}]
set_load -pin_load -max  0.005  [get_ports {cacheDataIn_B[31]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataIn_B[31]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataIn_B[30]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataIn_B[30]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataIn_B[29]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataIn_B[29]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataIn_B[28]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataIn_B[28]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataIn_B[27]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataIn_B[27]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataIn_B[26]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataIn_B[26]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataIn_B[25]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataIn_B[25]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataIn_B[24]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataIn_B[24]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataIn_B[23]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataIn_B[23]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataIn_B[22]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataIn_B[22]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataIn_B[21]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataIn_B[21]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataIn_B[20]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataIn_B[20]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataIn_B[19]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataIn_B[19]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataIn_B[18]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataIn_B[18]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataIn_B[17]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataIn_B[17]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataIn_B[16]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataIn_B[16]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataIn_B[15]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataIn_B[15]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataIn_B[14]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataIn_B[14]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataIn_B[13]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataIn_B[13]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataIn_B[12]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataIn_B[12]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataIn_B[11]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataIn_B[11]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataIn_B[10]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataIn_B[10]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataIn_B[9]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataIn_B[9]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataIn_B[8]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataIn_B[8]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataIn_B[7]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataIn_B[7]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataIn_B[6]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataIn_B[6]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataIn_B[5]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataIn_B[5]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataIn_B[4]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataIn_B[4]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataIn_B[3]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataIn_B[3]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataIn_B[2]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataIn_B[2]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataIn_B[1]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataIn_B[1]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataIn_B[0]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataIn_B[0]}]
set_load -pin_load -max  0.005  [get_ports {cacheAddressIn_B[7]}]
set_load -pin_load -min  0.005  [get_ports {cacheAddressIn_B[7]}]
set_load -pin_load -max  0.005  [get_ports {cacheAddressIn_B[6]}]
set_load -pin_load -min  0.005  [get_ports {cacheAddressIn_B[6]}]
set_load -pin_load -max  0.005  [get_ports {cacheAddressIn_B[5]}]
set_load -pin_load -min  0.005  [get_ports {cacheAddressIn_B[5]}]
set_load -pin_load -max  0.005  [get_ports {cacheAddressIn_B[4]}]
set_load -pin_load -min  0.005  [get_ports {cacheAddressIn_B[4]}]
set_load -pin_load -max  0.005  [get_ports {cacheAddressIn_B[3]}]
set_load -pin_load -min  0.005  [get_ports {cacheAddressIn_B[3]}]
set_load -pin_load -max  0.005  [get_ports {cacheAddressIn_B[2]}]
set_load -pin_load -min  0.005  [get_ports {cacheAddressIn_B[2]}]
set_load -pin_load -max  0.005  [get_ports {cacheAddressIn_B[1]}]
set_load -pin_load -min  0.005  [get_ports {cacheAddressIn_B[1]}]
set_load -pin_load -max  0.005  [get_ports {cacheAddressIn_B[0]}]
set_load -pin_load -min  0.005  [get_ports {cacheAddressIn_B[0]}]
set_max_capacitance 0.2  [get_ports {cacheDataOut_B[31]}]
set_max_fanout 4  [get_ports {cacheDataOut_B[31]}]
set_max_capacitance 0.2  [get_ports {cacheDataOut_B[30]}]
set_max_fanout 4  [get_ports {cacheDataOut_B[30]}]
set_max_capacitance 0.2  [get_ports {cacheDataOut_B[29]}]
set_max_fanout 4  [get_ports {cacheDataOut_B[29]}]
set_max_capacitance 0.2  [get_ports {cacheDataOut_B[28]}]
set_max_fanout 4  [get_ports {cacheDataOut_B[28]}]
set_max_capacitance 0.2  [get_ports {cacheDataOut_B[27]}]
set_max_fanout 4  [get_ports {cacheDataOut_B[27]}]
set_max_capacitance 0.2  [get_ports {cacheDataOut_B[26]}]
set_max_fanout 4  [get_ports {cacheDataOut_B[26]}]
set_max_capacitance 0.2  [get_ports {cacheDataOut_B[25]}]
set_max_fanout 4  [get_ports {cacheDataOut_B[25]}]
set_max_capacitance 0.2  [get_ports {cacheDataOut_B[24]}]
set_max_fanout 4  [get_ports {cacheDataOut_B[24]}]
set_max_capacitance 0.2  [get_ports {cacheDataOut_B[23]}]
set_max_fanout 4  [get_ports {cacheDataOut_B[23]}]
set_max_capacitance 0.2  [get_ports {cacheDataOut_B[22]}]
set_max_fanout 4  [get_ports {cacheDataOut_B[22]}]
set_max_capacitance 0.2  [get_ports {cacheDataOut_B[21]}]
set_max_fanout 4  [get_ports {cacheDataOut_B[21]}]
set_max_capacitance 0.2  [get_ports {cacheDataOut_B[20]}]
set_max_fanout 4  [get_ports {cacheDataOut_B[20]}]
set_max_capacitance 0.2  [get_ports {cacheDataOut_B[19]}]
set_max_fanout 4  [get_ports {cacheDataOut_B[19]}]
set_max_capacitance 0.2  [get_ports {cacheDataOut_B[18]}]
set_max_fanout 4  [get_ports {cacheDataOut_B[18]}]
set_max_capacitance 0.2  [get_ports {cacheDataOut_B[17]}]
set_max_fanout 4  [get_ports {cacheDataOut_B[17]}]
set_max_capacitance 0.2  [get_ports {cacheDataOut_B[16]}]
set_max_fanout 4  [get_ports {cacheDataOut_B[16]}]
set_max_capacitance 0.2  [get_ports {cacheDataOut_B[15]}]
set_max_fanout 4  [get_ports {cacheDataOut_B[15]}]
set_max_capacitance 0.2  [get_ports {cacheDataOut_B[14]}]
set_max_fanout 4  [get_ports {cacheDataOut_B[14]}]
set_max_capacitance 0.2  [get_ports {cacheDataOut_B[13]}]
set_max_fanout 4  [get_ports {cacheDataOut_B[13]}]
set_max_capacitance 0.2  [get_ports {cacheDataOut_B[12]}]
set_max_fanout 4  [get_ports {cacheDataOut_B[12]}]
set_max_capacitance 0.2  [get_ports {cacheDataOut_B[11]}]
set_max_fanout 4  [get_ports {cacheDataOut_B[11]}]
set_max_capacitance 0.2  [get_ports {cacheDataOut_B[10]}]
set_max_fanout 4  [get_ports {cacheDataOut_B[10]}]
set_max_capacitance 0.2  [get_ports {cacheDataOut_B[9]}]
set_max_fanout 4  [get_ports {cacheDataOut_B[9]}]
set_max_capacitance 0.2  [get_ports {cacheDataOut_B[8]}]
set_max_fanout 4  [get_ports {cacheDataOut_B[8]}]
set_max_capacitance 0.2  [get_ports {cacheDataOut_B[7]}]
set_max_fanout 4  [get_ports {cacheDataOut_B[7]}]
set_max_capacitance 0.2  [get_ports {cacheDataOut_B[6]}]
set_max_fanout 4  [get_ports {cacheDataOut_B[6]}]
set_max_capacitance 0.2  [get_ports {cacheDataOut_B[5]}]
set_max_fanout 4  [get_ports {cacheDataOut_B[5]}]
set_max_capacitance 0.2  [get_ports {cacheDataOut_B[4]}]
set_max_fanout 4  [get_ports {cacheDataOut_B[4]}]
set_max_capacitance 0.2  [get_ports {cacheDataOut_B[3]}]
set_max_fanout 4  [get_ports {cacheDataOut_B[3]}]
set_max_capacitance 0.2  [get_ports {cacheDataOut_B[2]}]
set_max_fanout 4  [get_ports {cacheDataOut_B[2]}]
set_max_capacitance 0.2  [get_ports {cacheDataOut_B[1]}]
set_max_fanout 4  [get_ports {cacheDataOut_B[1]}]
set_max_capacitance 0.2  [get_ports {cacheDataOut_B[0]}]
set_max_fanout 4  [get_ports {cacheDataOut_B[0]}]
set_load -pin_load -max  0.005  [get_ports {memWrite_B}]
set_load -pin_load -min  0.005  [get_ports {memWrite_B}]
set_max_capacitance 0.2  [get_ports {portB_writtenTo}]
set_max_fanout 4  [get_ports {portB_writtenTo}]
set_max_fanout 4  [get_designs {router}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_B[6]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {portA_writtenTo}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {requesterAddressIn_WEST[5]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressIn_WEST[13]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressIn_SOUTH[1]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_NORTH[17]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_NORTH[31]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_NORTH[24]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_SOUTH[20]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_SOUTH[13]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_NORTH[1]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_WEST[12]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressIn_WEST[0]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {requesterAddressIn_EAST[4]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_SOUTH[0]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {readIn_NORTH}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {requesterAddressIn_NORTH[1]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_B[15]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_B[22]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {requesterAddressIn_SOUTH[0]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressIn_NORTH[3]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_B[7]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_NORTH[18]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_NORTH[25]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_SOUTH[21]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_SOUTH[14]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressIn_EAST[10]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_NORTH[2]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressIn_SOUTH[2]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_WEST[13]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_WEST[20]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressIn_WEST[1]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_SOUTH[1]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {requesterAddressIn_NORTH[2]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {requesterAddressIn_EAST[5]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_B[16]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_B[23]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_B[30]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressIn_EAST[0]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {requesterAddressIn_SOUTH[1]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressIn_NORTH[4]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_B[8]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_SOUTH[22]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_SOUTH[15]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {writeIn_SOUTH}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressIn_EAST[11]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_NORTH[3]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressIn_SOUTH[3]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_NORTH[19]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_NORTH[26]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {portB_writtenTo}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_WEST[14]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_WEST[21]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressIn_WEST[2]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_EAST[10]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {requesterAddressIn_NORTH[3]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_SOUTH[2]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_B[17]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_B[24]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_B[31]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_A[0]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {requesterAddressIn_SOUTH[2]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressIn_NORTH[5]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressIn_EAST[1]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_B[9]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {readIn_SOUTH}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_SOUTH[30]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_SOUTH[23]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_SOUTH[16]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressIn_EAST[12]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_NORTH[4]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressIn_SOUTH[4]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_NORTH[27]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_WEST[15]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_WEST[22]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressIn_WEST[3]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {requesterAddressIn_NORTH[4]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_EAST[11]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_SOUTH[3]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_B[18]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_B[25]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_A[1]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {requesterAddressIn_SOUTH[3]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressIn_NORTH[6]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressIn_EAST[2]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_A[10]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_SOUTH[31]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_SOUTH[24]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_SOUTH[17]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressIn_EAST[13]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_NORTH[5]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressIn_SOUTH[5]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_NORTH[28]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_WEST[16]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_WEST[23]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_WEST[30]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressIn_WEST[4]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {requesterAddressIn_NORTH[5]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_EAST[12]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_SOUTH[4]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_B[19]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_B[26]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_A[2]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {requesterAddressIn_SOUTH[4]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressIn_NORTH[7]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressIn_EAST[3]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_A[11]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_SOUTH[25]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_SOUTH[18]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_NORTH[6]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressIn_SOUTH[6]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_NORTH[29]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_WEST[17]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_WEST[24]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_WEST[31]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressIn_WEST[5]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_EAST[20]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_EAST[13]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_SOUTH[5]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_B[27]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_A[3]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {requesterAddressIn_SOUTH[5]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressIn_NORTH[8]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressIn_EAST[4]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_A[12]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_SOUTH[26]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_SOUTH[19]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_NORTH[7]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressIn_SOUTH[7]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_WEST[18]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_WEST[25]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressIn_WEST[6]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_EAST[21]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_EAST[14]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_SOUTH[6]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_B[28]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_A[4]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_WEST[0]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressIn_NORTH[9]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressIn_EAST[5]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressIn_NORTH[10]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_A[13]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_A[20]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_SOUTH[27]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_NORTH[8]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressIn_SOUTH[8]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_WEST[19]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_WEST[26]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressIn_WEST[7]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_EAST[22]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_EAST[15]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_SOUTH[7]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {reset}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_B[29]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_A[5]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_WEST[1]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressIn_EAST[6]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {localRouterAddress[0]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressIn_NORTH[11]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_A[14]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_A[21]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_EAST[0]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_NORTH[9]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressIn_SOUTH[9]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_SOUTH[28]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_WEST[27]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressIn_WEST[8]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_EAST[30]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_EAST[23]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_EAST[16]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_SOUTH[8]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_A[6]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_WEST[2]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressIn_EAST[7]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {localRouterAddress[1]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressIn_NORTH[12]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_A[15]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_A[22]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_EAST[1]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_SOUTH[29]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_WEST[28]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressIn_WEST[9]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_SOUTH[9]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_EAST[31]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_EAST[24]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_EAST[17]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_A[7]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_WEST[3]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressIn_EAST[8]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {localRouterAddress[2]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressIn_NORTH[13]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_A[16]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_A[23]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_A[30]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_EAST[2]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_WEST[29]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_EAST[25]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_EAST[18]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_A[8]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_WEST[4]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressIn_SOUTH[10]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {localRouterAddress[3]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_NORTH[10]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressIn_EAST[9]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_A[17]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_A[24]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_A[31]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_EAST[3]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_EAST[26]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_EAST[19]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_B[0]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_A[9]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_WEST[5]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressIn_SOUTH[11]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {localRouterAddress[4]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_NORTH[11]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_A[18]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_A[25]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {writeIn_WEST}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_EAST[4]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {readIn_WEST}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_EAST[27]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_B[1]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_WEST[6]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {requesterAddressIn_WEST[0]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {localRouterAddress[5]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_NORTH[12]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressIn_SOUTH[12]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_A[19]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_A[26]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_EAST[5]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_B[10]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_EAST[28]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_B[2]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_WEST[7]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {requesterAddressIn_WEST[1]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_NORTH[13]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_NORTH[20]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressIn_SOUTH[13]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_A[27]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_EAST[6]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {requesterAddressIn_EAST[0]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_B[11]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_EAST[29]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_B[3]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_WEST[8]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {requesterAddressIn_WEST[2]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressIn_WEST[10]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_SOUTH[10]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_NORTH[14]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_NORTH[21]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {writeIn_EAST}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_A[28]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_EAST[7]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {requesterAddressIn_EAST[1]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {readIn_EAST}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_B[12]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressIn_NORTH[0]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_B[4]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_WEST[9]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {requesterAddressIn_WEST[3]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressIn_WEST[11]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_SOUTH[11]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_NORTH[15]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_NORTH[22]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_A[29]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_WEST[10]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_EAST[8]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {requesterAddressIn_EAST[2]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_B[13]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_B[20]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressIn_NORTH[1]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_B[5]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {requesterAddressIn_WEST[4]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressIn_WEST[12]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_NORTH[0]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressIn_SOUTH[0]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_NORTH[16]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_NORTH[30]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_NORTH[23]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_SOUTH[12]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_WEST[11]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataIn_EAST[9]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {writeIn_NORTH}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {requesterAddressIn_EAST[3]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {requesterAddressIn_NORTH[0]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_B[14]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_B[21]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressIn_NORTH[2]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_A[3]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_EAST[7]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_B[14]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_B[21]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheAddressIn_A[4]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_NORTH[11]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_WEST[9]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_WEST[29]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressOut_EAST[9]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_EAST[25]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_EAST[18]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_A[4]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_EAST[8]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_B[15]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_B[22]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheAddressIn_A[5]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_NORTH[12]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_EAST[26]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_EAST[19]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_A[5]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_EAST[9]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_B[16]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_B[23]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_B[30]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheAddressIn_A[6]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {writeOut_WEST}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressOut_WEST[10]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_NORTH[13]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_NORTH[20]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_EAST[27]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_A[6]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressOut_NORTH[0]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_B[17]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_B[24]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_B[31]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheAddressIn_A[7]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {readOut_WEST}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressOut_WEST[11]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_SOUTH[10]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_NORTH[14]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_NORTH[21]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_EAST[28]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_A[7]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressOut_NORTH[1]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_B[18]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_B[25]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressOut_WEST[12]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_SOUTH[11]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_NORTH[15]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_NORTH[22]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressOut_SOUTH[0]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_A[10]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_EAST[29]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_A[8]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressOut_NORTH[10]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressOut_NORTH[2]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {writeOut_EAST}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheAddressIn_B[0]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_B[19]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_B[26]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressOut_WEST[13]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_NORTH[30]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_NORTH[23]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_NORTH[16]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressOut_SOUTH[1]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_SOUTH[12]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_A[11]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {writeOut_NORTH}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_B[0]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_A[9]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {readOut_EAST}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressOut_NORTH[3]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressOut_NORTH[11]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheAddressIn_B[1]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_B[27]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_WEST[10]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressOut_EAST[10]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_NORTH[31]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_NORTH[24]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_NORTH[17]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressOut_SOUTH[2]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_SOUTH[20]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_SOUTH[13]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_A[12]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_B[1]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_NORTH[0]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressOut_NORTH[12]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressOut_NORTH[4]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheAddressIn_B[2]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_B[28]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_WEST[11]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_NORTH[25]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_NORTH[18]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressOut_SOUTH[3]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_SOUTH[21]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_SOUTH[14]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressOut_EAST[11]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_A[13]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_A[20]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_B[2]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressOut_WEST[0]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {requesterAddressOut_NORTH[0]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_NORTH[1]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressOut_NORTH[13]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressOut_NORTH[5]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheAddressIn_B[3]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_B[29]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_WEST[12]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressOut_SOUTH[4]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {writeOut_SOUTH}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_SOUTH[0]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_SOUTH[22]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_SOUTH[15]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressOut_EAST[12]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_NORTH[26]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_NORTH[19]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_A[14]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_A[21]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {readOut_NORTH}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_B[3]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressOut_WEST[1]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressOut_SOUTH[10]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_NORTH[2]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressOut_NORTH[6]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {requesterAddressOut_NORTH[1]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheAddressIn_B[4]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_WEST[0]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_WEST[13]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_WEST[20]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressOut_EAST[0]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {requesterAddressOut_SOUTH[0]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_SOUTH[1]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_SOUTH[30]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_SOUTH[23]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_SOUTH[16]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressOut_EAST[13]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_NORTH[27]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressOut_SOUTH[5]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_A[15]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_A[22]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {requesterAddressOut_WEST[0]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_B[4]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressOut_WEST[2]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_NORTH[3]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressOut_SOUTH[11]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressOut_NORTH[7]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {requesterAddressOut_NORTH[2]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheAddressIn_B[5]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_WEST[1]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_WEST[14]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_WEST[21]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressOut_EAST[1]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {requesterAddressOut_SOUTH[1]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_EAST[10]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_SOUTH[2]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_SOUTH[31]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_SOUTH[24]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_SOUTH[17]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_NORTH[28]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressOut_SOUTH[6]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_A[16]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_A[23]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_A[30]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {requesterAddressOut_WEST[1]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_EAST[0]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_B[5]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressOut_WEST[3]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressOut_NORTH[8]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {requesterAddressOut_EAST[0]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {requesterAddressOut_NORTH[3]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_NORTH[4]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressOut_SOUTH[12]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheAddressIn_B[6]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_WEST[2]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_WEST[15]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_WEST[22]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_SOUTH[3]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_SOUTH[25]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_SOUTH[18]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_NORTH[29]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressOut_SOUTH[7]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {readOut_SOUTH}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressOut_EAST[2]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {requesterAddressOut_SOUTH[2]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_EAST[11]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_A[17]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_A[24]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_A[31]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {requesterAddressOut_WEST[2]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_EAST[1]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_B[6]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressOut_WEST[4]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressOut_NORTH[9]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {requesterAddressOut_EAST[1]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {requesterAddressOut_NORTH[4]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_NORTH[5]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressOut_SOUTH[13]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheAddressIn_B[7]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_WEST[3]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_WEST[16]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_WEST[23]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_WEST[30]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_SOUTH[4]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_SOUTH[26]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_SOUTH[19]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressOut_SOUTH[8]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressOut_EAST[3]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {requesterAddressOut_SOUTH[3]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_EAST[12]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_A[18]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_A[25]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {requesterAddressOut_WEST[3]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_EAST[2]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_B[7]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressOut_WEST[5]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {requesterAddressOut_EAST[2]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {requesterAddressOut_NORTH[5]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_NORTH[6]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_WEST[4]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_WEST[17]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_WEST[24]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_WEST[31]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_SOUTH[27]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressOut_SOUTH[9]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressOut_EAST[4]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {requesterAddressOut_SOUTH[4]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_EAST[20]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_EAST[13]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_SOUTH[5]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_A[19]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_A[26]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {requesterAddressOut_WEST[4]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_EAST[3]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_B[8]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_B[10]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheAddressIn_A[0]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressOut_WEST[6]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {requesterAddressOut_EAST[3]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_NORTH[7]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_WEST[5]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_WEST[18]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_WEST[25]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressOut_EAST[5]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {requesterAddressOut_SOUTH[5]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_EAST[21]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_EAST[14]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_SOUTH[6]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_SOUTH[28]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_A[0]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_A[27]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {requesterAddressOut_WEST[5]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_EAST[4]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_B[9]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_B[11]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheAddressIn_A[1]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressOut_WEST[7]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {requesterAddressOut_EAST[4]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_NORTH[8]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_WEST[6]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_WEST[19]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_WEST[26]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressOut_EAST[6]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_EAST[22]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_EAST[15]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_SOUTH[7]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_SOUTH[29]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_A[1]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_A[28]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_EAST[5]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_B[12]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheAddressIn_A[2]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressOut_WEST[8]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {requesterAddressOut_EAST[5]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_NORTH[9]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {memWrite_A}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_WEST[7]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_WEST[27]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressOut_EAST[7]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_EAST[30]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_EAST[23]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_EAST[16]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_SOUTH[8]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {memWrite_B}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_A[2]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_A[29]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_EAST[6]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_B[13]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_B[20]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheAddressIn_A[3]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressOut_WEST[9]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_NORTH[10]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_WEST[8]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_WEST[28]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {destinationAddressOut_EAST[8]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_EAST[31]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_EAST[24]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_EAST[17]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {dataOut_SOUTH[9]}]
set_clock_uncertainty 0 [get_clocks {clk}]
