###############################################################
#  Generated by:      Cadence Encounter 14.23-s044_1
#  OS:                Linux x86_64(Host ID cadpc42)
#  Generated on:      Wed Feb 27 22:15:15 2019
#  Design:            lfsr1
#  Command:           saveDesign lfsr1.opted.enc
###############################################################
current_design lfsr1
create_clock [get_ports {clk}]  -name clk -period 12.000000 -waveform {0.000000 6.000000}
set_clock_latency 0  [get_clocks {clk}]
set_clock_transition  -rise -min 1.5 [get_clocks {clk}]
set_clock_transition  -rise -max 1.5 [get_clocks {clk}]
set_clock_transition  -fall -min 1.5 [get_clocks {clk}]
set_clock_transition  -fall -max 1.5 [get_clocks {clk}]
set_propagated_clock  [get_ports {clk}]
set_max_capacitance 0.2  [get_ports {clk}]
set_max_fanout 4  [get_ports {clk}]
set_max_capacitance 0.2  [get_ports {resetn}]
set_max_fanout 4  [get_ports {resetn}]
set_load -pin_load -max  0.005  [get_ports {lfsr_out[27]}]
set_load -pin_load -min  0.005  [get_ports {lfsr_out[27]}]
set_load -pin_load -max  0.005  [get_ports {lfsr_out[26]}]
set_load -pin_load -min  0.005  [get_ports {lfsr_out[26]}]
set_load -pin_load -max  0.005  [get_ports {lfsr_out[25]}]
set_load -pin_load -min  0.005  [get_ports {lfsr_out[25]}]
set_load -pin_load -max  0.005  [get_ports {lfsr_out[24]}]
set_load -pin_load -min  0.005  [get_ports {lfsr_out[24]}]
set_load -pin_load -max  0.005  [get_ports {lfsr_out[23]}]
set_load -pin_load -min  0.005  [get_ports {lfsr_out[23]}]
set_load -pin_load -max  0.005  [get_ports {lfsr_out[22]}]
set_load -pin_load -min  0.005  [get_ports {lfsr_out[22]}]
set_load -pin_load -max  0.005  [get_ports {lfsr_out[21]}]
set_load -pin_load -min  0.005  [get_ports {lfsr_out[21]}]
set_load -pin_load -max  0.005  [get_ports {lfsr_out[20]}]
set_load -pin_load -min  0.005  [get_ports {lfsr_out[20]}]
set_load -pin_load -max  0.005  [get_ports {lfsr_out[19]}]
set_load -pin_load -min  0.005  [get_ports {lfsr_out[19]}]
set_load -pin_load -max  0.005  [get_ports {lfsr_out[18]}]
set_load -pin_load -min  0.005  [get_ports {lfsr_out[18]}]
set_load -pin_load -max  0.005  [get_ports {lfsr_out[17]}]
set_load -pin_load -min  0.005  [get_ports {lfsr_out[17]}]
set_load -pin_load -max  0.005  [get_ports {lfsr_out[16]}]
set_load -pin_load -min  0.005  [get_ports {lfsr_out[16]}]
set_load -pin_load -max  0.005  [get_ports {lfsr_out[15]}]
set_load -pin_load -min  0.005  [get_ports {lfsr_out[15]}]
set_load -pin_load -max  0.005  [get_ports {lfsr_out[14]}]
set_load -pin_load -min  0.005  [get_ports {lfsr_out[14]}]
set_load -pin_load -max  0.005  [get_ports {lfsr_out[13]}]
set_load -pin_load -min  0.005  [get_ports {lfsr_out[13]}]
set_load -pin_load -max  0.005  [get_ports {lfsr_out[12]}]
set_load -pin_load -min  0.005  [get_ports {lfsr_out[12]}]
set_load -pin_load -max  0.005  [get_ports {lfsr_out[11]}]
set_load -pin_load -min  0.005  [get_ports {lfsr_out[11]}]
set_load -pin_load -max  0.005  [get_ports {lfsr_out[10]}]
set_load -pin_load -min  0.005  [get_ports {lfsr_out[10]}]
set_load -pin_load -max  0.005  [get_ports {lfsr_out[9]}]
set_load -pin_load -min  0.005  [get_ports {lfsr_out[9]}]
set_load -pin_load -max  0.005  [get_ports {lfsr_out[8]}]
set_load -pin_load -min  0.005  [get_ports {lfsr_out[8]}]
set_load -pin_load -max  0.005  [get_ports {lfsr_out[7]}]
set_load -pin_load -min  0.005  [get_ports {lfsr_out[7]}]
set_load -pin_load -max  0.005  [get_ports {lfsr_out[6]}]
set_load -pin_load -min  0.005  [get_ports {lfsr_out[6]}]
set_load -pin_load -max  0.005  [get_ports {lfsr_out[5]}]
set_load -pin_load -min  0.005  [get_ports {lfsr_out[5]}]
set_load -pin_load -max  0.005  [get_ports {lfsr_out[4]}]
set_load -pin_load -min  0.005  [get_ports {lfsr_out[4]}]
set_load -pin_load -max  0.005  [get_ports {lfsr_out[3]}]
set_load -pin_load -min  0.005  [get_ports {lfsr_out[3]}]
set_load -pin_load -max  0.005  [get_ports {lfsr_out[2]}]
set_load -pin_load -min  0.005  [get_ports {lfsr_out[2]}]
set_load -pin_load -max  0.005  [get_ports {lfsr_out[1]}]
set_load -pin_load -min  0.005  [get_ports {lfsr_out[1]}]
set_load -pin_load -max  0.005  [get_ports {lfsr_out[0]}]
set_load -pin_load -min  0.005  [get_ports {lfsr_out[0]}]
set_max_fanout 4  [get_designs {lfsr1}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {resetn}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {lfsr_out[10]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {lfsr_out[9]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {lfsr_out[7]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {lfsr_out[5]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {lfsr_out[3]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {lfsr_out[1]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {lfsr_out[19]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {lfsr_out[26]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {lfsr_out[17]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {lfsr_out[24]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {lfsr_out[15]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {lfsr_out[22]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {lfsr_out[13]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {lfsr_out[20]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {lfsr_out[11]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {lfsr_out[8]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {lfsr_out[6]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {lfsr_out[4]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {lfsr_out[2]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {lfsr_out[27]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {lfsr_out[0]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {lfsr_out[18]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {lfsr_out[25]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {lfsr_out[16]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {lfsr_out[23]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {lfsr_out[14]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {lfsr_out[21]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {lfsr_out[12]}]
set_clock_uncertainty 0 [get_clocks {clk}]
