###############################################################
#  Generated by:      Cadence Encounter 14.23-s044_1
#  OS:                Linux x86_64(Host ID cadpc04)
#  Generated on:      Tue May 14 23:22:02 2019
#  Design:            cacheBank
#  Command:           saveDesign cache.routed.enc
###############################################################
current_design cacheBank
create_clock [get_ports {clk}]  -name clk -period 12.000000 -waveform {0.000000 6.000000}
set_clock_latency 0  [get_clocks {clk}]
set_clock_transition  -rise -min 1.5 [get_clocks {clk}]
set_clock_transition  -rise -max 1.5 [get_clocks {clk}]
set_clock_transition  -fall -min 1.5 [get_clocks {clk}]
set_clock_transition  -fall -max 1.5 [get_clocks {clk}]
set_propagated_clock  [get_ports {clk}]
set_max_capacitance 0.2  [get_ports {clk}]
set_max_fanout 4  [get_ports {clk}]
set_max_capacitance 0.2  [get_ports {reset}]
set_max_fanout 4  [get_ports {reset}]
set_max_capacitance 0.2  [get_ports {cacheDataIn_A[31]}]
set_max_fanout 4  [get_ports {cacheDataIn_A[31]}]
set_max_capacitance 0.2  [get_ports {cacheDataIn_A[30]}]
set_max_fanout 4  [get_ports {cacheDataIn_A[30]}]
set_max_capacitance 0.2  [get_ports {cacheDataIn_A[29]}]
set_max_fanout 4  [get_ports {cacheDataIn_A[29]}]
set_max_capacitance 0.2  [get_ports {cacheDataIn_A[28]}]
set_max_fanout 4  [get_ports {cacheDataIn_A[28]}]
set_max_capacitance 0.2  [get_ports {cacheDataIn_A[27]}]
set_max_fanout 4  [get_ports {cacheDataIn_A[27]}]
set_max_capacitance 0.2  [get_ports {cacheDataIn_A[26]}]
set_max_fanout 4  [get_ports {cacheDataIn_A[26]}]
set_max_capacitance 0.2  [get_ports {cacheDataIn_A[25]}]
set_max_fanout 4  [get_ports {cacheDataIn_A[25]}]
set_max_capacitance 0.2  [get_ports {cacheDataIn_A[24]}]
set_max_fanout 4  [get_ports {cacheDataIn_A[24]}]
set_max_capacitance 0.2  [get_ports {cacheDataIn_A[23]}]
set_max_fanout 4  [get_ports {cacheDataIn_A[23]}]
set_max_capacitance 0.2  [get_ports {cacheDataIn_A[22]}]
set_max_fanout 4  [get_ports {cacheDataIn_A[22]}]
set_max_capacitance 0.2  [get_ports {cacheDataIn_A[21]}]
set_max_fanout 4  [get_ports {cacheDataIn_A[21]}]
set_max_capacitance 0.2  [get_ports {cacheDataIn_A[20]}]
set_max_fanout 4  [get_ports {cacheDataIn_A[20]}]
set_max_capacitance 0.2  [get_ports {cacheDataIn_A[19]}]
set_max_fanout 4  [get_ports {cacheDataIn_A[19]}]
set_max_capacitance 0.2  [get_ports {cacheDataIn_A[18]}]
set_max_fanout 4  [get_ports {cacheDataIn_A[18]}]
set_max_capacitance 0.2  [get_ports {cacheDataIn_A[17]}]
set_max_fanout 4  [get_ports {cacheDataIn_A[17]}]
set_max_capacitance 0.2  [get_ports {cacheDataIn_A[16]}]
set_max_fanout 4  [get_ports {cacheDataIn_A[16]}]
set_max_capacitance 0.2  [get_ports {cacheDataIn_A[15]}]
set_max_fanout 4  [get_ports {cacheDataIn_A[15]}]
set_max_capacitance 0.2  [get_ports {cacheDataIn_A[14]}]
set_max_fanout 4  [get_ports {cacheDataIn_A[14]}]
set_max_capacitance 0.2  [get_ports {cacheDataIn_A[13]}]
set_max_fanout 4  [get_ports {cacheDataIn_A[13]}]
set_max_capacitance 0.2  [get_ports {cacheDataIn_A[12]}]
set_max_fanout 4  [get_ports {cacheDataIn_A[12]}]
set_max_capacitance 0.2  [get_ports {cacheDataIn_A[11]}]
set_max_fanout 4  [get_ports {cacheDataIn_A[11]}]
set_max_capacitance 0.2  [get_ports {cacheDataIn_A[10]}]
set_max_fanout 4  [get_ports {cacheDataIn_A[10]}]
set_max_capacitance 0.2  [get_ports {cacheDataIn_A[9]}]
set_max_fanout 4  [get_ports {cacheDataIn_A[9]}]
set_max_capacitance 0.2  [get_ports {cacheDataIn_A[8]}]
set_max_fanout 4  [get_ports {cacheDataIn_A[8]}]
set_max_capacitance 0.2  [get_ports {cacheDataIn_A[7]}]
set_max_fanout 4  [get_ports {cacheDataIn_A[7]}]
set_max_capacitance 0.2  [get_ports {cacheDataIn_A[6]}]
set_max_fanout 4  [get_ports {cacheDataIn_A[6]}]
set_max_capacitance 0.2  [get_ports {cacheDataIn_A[5]}]
set_max_fanout 4  [get_ports {cacheDataIn_A[5]}]
set_max_capacitance 0.2  [get_ports {cacheDataIn_A[4]}]
set_max_fanout 4  [get_ports {cacheDataIn_A[4]}]
set_max_capacitance 0.2  [get_ports {cacheDataIn_A[3]}]
set_max_fanout 4  [get_ports {cacheDataIn_A[3]}]
set_max_capacitance 0.2  [get_ports {cacheDataIn_A[2]}]
set_max_fanout 4  [get_ports {cacheDataIn_A[2]}]
set_max_capacitance 0.2  [get_ports {cacheDataIn_A[1]}]
set_max_fanout 4  [get_ports {cacheDataIn_A[1]}]
set_max_capacitance 0.2  [get_ports {cacheDataIn_A[0]}]
set_max_fanout 4  [get_ports {cacheDataIn_A[0]}]
set_max_capacitance 0.2  [get_ports {cacheAddressIn_A[7]}]
set_max_fanout 4  [get_ports {cacheAddressIn_A[7]}]
set_max_capacitance 0.2  [get_ports {cacheAddressIn_A[6]}]
set_max_fanout 4  [get_ports {cacheAddressIn_A[6]}]
set_max_capacitance 0.2  [get_ports {cacheAddressIn_A[5]}]
set_max_fanout 4  [get_ports {cacheAddressIn_A[5]}]
set_max_capacitance 0.2  [get_ports {cacheAddressIn_A[4]}]
set_max_fanout 4  [get_ports {cacheAddressIn_A[4]}]
set_max_capacitance 0.2  [get_ports {cacheAddressIn_A[3]}]
set_max_fanout 4  [get_ports {cacheAddressIn_A[3]}]
set_max_capacitance 0.2  [get_ports {cacheAddressIn_A[2]}]
set_max_fanout 4  [get_ports {cacheAddressIn_A[2]}]
set_max_capacitance 0.2  [get_ports {cacheAddressIn_A[1]}]
set_max_fanout 4  [get_ports {cacheAddressIn_A[1]}]
set_max_capacitance 0.2  [get_ports {cacheAddressIn_A[0]}]
set_max_fanout 4  [get_ports {cacheAddressIn_A[0]}]
set_max_capacitance 0.2  [get_ports {memWrite_A}]
set_max_fanout 4  [get_ports {memWrite_A}]
set_load -pin_load -max  0.005  [get_ports {cacheDataOut_A[31]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataOut_A[31]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataOut_A[30]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataOut_A[30]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataOut_A[29]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataOut_A[29]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataOut_A[28]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataOut_A[28]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataOut_A[27]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataOut_A[27]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataOut_A[26]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataOut_A[26]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataOut_A[25]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataOut_A[25]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataOut_A[24]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataOut_A[24]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataOut_A[23]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataOut_A[23]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataOut_A[22]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataOut_A[22]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataOut_A[21]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataOut_A[21]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataOut_A[20]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataOut_A[20]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataOut_A[19]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataOut_A[19]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataOut_A[18]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataOut_A[18]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataOut_A[17]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataOut_A[17]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataOut_A[16]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataOut_A[16]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataOut_A[15]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataOut_A[15]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataOut_A[14]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataOut_A[14]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataOut_A[13]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataOut_A[13]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataOut_A[12]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataOut_A[12]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataOut_A[11]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataOut_A[11]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataOut_A[10]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataOut_A[10]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataOut_A[9]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataOut_A[9]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataOut_A[8]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataOut_A[8]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataOut_A[7]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataOut_A[7]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataOut_A[6]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataOut_A[6]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataOut_A[5]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataOut_A[5]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataOut_A[4]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataOut_A[4]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataOut_A[3]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataOut_A[3]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataOut_A[2]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataOut_A[2]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataOut_A[1]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataOut_A[1]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataOut_A[0]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataOut_A[0]}]
set_load -pin_load -max  0.005  [get_ports {portA_writtenTo}]
set_load -pin_load -min  0.005  [get_ports {portA_writtenTo}]
set_max_capacitance 0.2  [get_ports {cacheDataIn_B[31]}]
set_max_fanout 4  [get_ports {cacheDataIn_B[31]}]
set_max_capacitance 0.2  [get_ports {cacheDataIn_B[30]}]
set_max_fanout 4  [get_ports {cacheDataIn_B[30]}]
set_max_capacitance 0.2  [get_ports {cacheDataIn_B[29]}]
set_max_fanout 4  [get_ports {cacheDataIn_B[29]}]
set_max_capacitance 0.2  [get_ports {cacheDataIn_B[28]}]
set_max_fanout 4  [get_ports {cacheDataIn_B[28]}]
set_max_capacitance 0.2  [get_ports {cacheDataIn_B[27]}]
set_max_fanout 4  [get_ports {cacheDataIn_B[27]}]
set_max_capacitance 0.2  [get_ports {cacheDataIn_B[26]}]
set_max_fanout 4  [get_ports {cacheDataIn_B[26]}]
set_max_capacitance 0.2  [get_ports {cacheDataIn_B[25]}]
set_max_fanout 4  [get_ports {cacheDataIn_B[25]}]
set_max_capacitance 0.2  [get_ports {cacheDataIn_B[24]}]
set_max_fanout 4  [get_ports {cacheDataIn_B[24]}]
set_max_capacitance 0.2  [get_ports {cacheDataIn_B[23]}]
set_max_fanout 4  [get_ports {cacheDataIn_B[23]}]
set_max_capacitance 0.2  [get_ports {cacheDataIn_B[22]}]
set_max_fanout 4  [get_ports {cacheDataIn_B[22]}]
set_max_capacitance 0.2  [get_ports {cacheDataIn_B[21]}]
set_max_fanout 4  [get_ports {cacheDataIn_B[21]}]
set_max_capacitance 0.2  [get_ports {cacheDataIn_B[20]}]
set_max_fanout 4  [get_ports {cacheDataIn_B[20]}]
set_max_capacitance 0.2  [get_ports {cacheDataIn_B[19]}]
set_max_fanout 4  [get_ports {cacheDataIn_B[19]}]
set_max_capacitance 0.2  [get_ports {cacheDataIn_B[18]}]
set_max_fanout 4  [get_ports {cacheDataIn_B[18]}]
set_max_capacitance 0.2  [get_ports {cacheDataIn_B[17]}]
set_max_fanout 4  [get_ports {cacheDataIn_B[17]}]
set_max_capacitance 0.2  [get_ports {cacheDataIn_B[16]}]
set_max_fanout 4  [get_ports {cacheDataIn_B[16]}]
set_max_capacitance 0.2  [get_ports {cacheDataIn_B[15]}]
set_max_fanout 4  [get_ports {cacheDataIn_B[15]}]
set_max_capacitance 0.2  [get_ports {cacheDataIn_B[14]}]
set_max_fanout 4  [get_ports {cacheDataIn_B[14]}]
set_max_capacitance 0.2  [get_ports {cacheDataIn_B[13]}]
set_max_fanout 4  [get_ports {cacheDataIn_B[13]}]
set_max_capacitance 0.2  [get_ports {cacheDataIn_B[12]}]
set_max_fanout 4  [get_ports {cacheDataIn_B[12]}]
set_max_capacitance 0.2  [get_ports {cacheDataIn_B[11]}]
set_max_fanout 4  [get_ports {cacheDataIn_B[11]}]
set_max_capacitance 0.2  [get_ports {cacheDataIn_B[10]}]
set_max_fanout 4  [get_ports {cacheDataIn_B[10]}]
set_max_capacitance 0.2  [get_ports {cacheDataIn_B[9]}]
set_max_fanout 4  [get_ports {cacheDataIn_B[9]}]
set_max_capacitance 0.2  [get_ports {cacheDataIn_B[8]}]
set_max_fanout 4  [get_ports {cacheDataIn_B[8]}]
set_max_capacitance 0.2  [get_ports {cacheDataIn_B[7]}]
set_max_fanout 4  [get_ports {cacheDataIn_B[7]}]
set_max_capacitance 0.2  [get_ports {cacheDataIn_B[6]}]
set_max_fanout 4  [get_ports {cacheDataIn_B[6]}]
set_max_capacitance 0.2  [get_ports {cacheDataIn_B[5]}]
set_max_fanout 4  [get_ports {cacheDataIn_B[5]}]
set_max_capacitance 0.2  [get_ports {cacheDataIn_B[4]}]
set_max_fanout 4  [get_ports {cacheDataIn_B[4]}]
set_max_capacitance 0.2  [get_ports {cacheDataIn_B[3]}]
set_max_fanout 4  [get_ports {cacheDataIn_B[3]}]
set_max_capacitance 0.2  [get_ports {cacheDataIn_B[2]}]
set_max_fanout 4  [get_ports {cacheDataIn_B[2]}]
set_max_capacitance 0.2  [get_ports {cacheDataIn_B[1]}]
set_max_fanout 4  [get_ports {cacheDataIn_B[1]}]
set_max_capacitance 0.2  [get_ports {cacheDataIn_B[0]}]
set_max_fanout 4  [get_ports {cacheDataIn_B[0]}]
set_max_capacitance 0.2  [get_ports {cacheAddressIn_B[7]}]
set_max_fanout 4  [get_ports {cacheAddressIn_B[7]}]
set_max_capacitance 0.2  [get_ports {cacheAddressIn_B[6]}]
set_max_fanout 4  [get_ports {cacheAddressIn_B[6]}]
set_max_capacitance 0.2  [get_ports {cacheAddressIn_B[5]}]
set_max_fanout 4  [get_ports {cacheAddressIn_B[5]}]
set_max_capacitance 0.2  [get_ports {cacheAddressIn_B[4]}]
set_max_fanout 4  [get_ports {cacheAddressIn_B[4]}]
set_max_capacitance 0.2  [get_ports {cacheAddressIn_B[3]}]
set_max_fanout 4  [get_ports {cacheAddressIn_B[3]}]
set_max_capacitance 0.2  [get_ports {cacheAddressIn_B[2]}]
set_max_fanout 4  [get_ports {cacheAddressIn_B[2]}]
set_max_capacitance 0.2  [get_ports {cacheAddressIn_B[1]}]
set_max_fanout 4  [get_ports {cacheAddressIn_B[1]}]
set_max_capacitance 0.2  [get_ports {cacheAddressIn_B[0]}]
set_max_fanout 4  [get_ports {cacheAddressIn_B[0]}]
set_max_capacitance 0.2  [get_ports {memWrite_B}]
set_max_fanout 4  [get_ports {memWrite_B}]
set_load -pin_load -max  0.005  [get_ports {cacheDataOut_B[31]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataOut_B[31]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataOut_B[30]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataOut_B[30]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataOut_B[29]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataOut_B[29]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataOut_B[28]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataOut_B[28]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataOut_B[27]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataOut_B[27]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataOut_B[26]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataOut_B[26]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataOut_B[25]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataOut_B[25]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataOut_B[24]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataOut_B[24]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataOut_B[23]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataOut_B[23]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataOut_B[22]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataOut_B[22]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataOut_B[21]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataOut_B[21]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataOut_B[20]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataOut_B[20]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataOut_B[19]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataOut_B[19]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataOut_B[18]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataOut_B[18]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataOut_B[17]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataOut_B[17]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataOut_B[16]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataOut_B[16]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataOut_B[15]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataOut_B[15]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataOut_B[14]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataOut_B[14]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataOut_B[13]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataOut_B[13]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataOut_B[12]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataOut_B[12]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataOut_B[11]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataOut_B[11]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataOut_B[10]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataOut_B[10]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataOut_B[9]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataOut_B[9]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataOut_B[8]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataOut_B[8]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataOut_B[7]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataOut_B[7]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataOut_B[6]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataOut_B[6]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataOut_B[5]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataOut_B[5]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataOut_B[4]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataOut_B[4]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataOut_B[3]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataOut_B[3]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataOut_B[2]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataOut_B[2]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataOut_B[1]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataOut_B[1]}]
set_load -pin_load -max  0.005  [get_ports {cacheDataOut_B[0]}]
set_load -pin_load -min  0.005  [get_ports {cacheDataOut_B[0]}]
set_load -pin_load -max  0.005  [get_ports {portB_writtenTo}]
set_load -pin_load -min  0.005  [get_ports {portB_writtenTo}]
set_max_fanout 4  [get_designs {cacheBank}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_A[3]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_B[3]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_B[30]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_B[23]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_B[16]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_A[17]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_A[24]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_A[31]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheAddressIn_A[0]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_A[4]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheAddressIn_B[0]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_B[4]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {reset}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_B[31]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_B[24]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_B[17]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_A[18]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_A[25]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheAddressIn_A[1]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_A[5]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheAddressIn_B[1]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_B[5]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_B[25]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_B[18]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_A[10]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_A[19]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_A[26]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheAddressIn_A[2]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_A[6]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheAddressIn_B[2]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_B[10]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_B[6]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_B[26]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_B[19]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_A[11]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {memWrite_A}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_A[27]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheAddressIn_A[3]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {memWrite_B}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_A[7]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheAddressIn_B[3]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_B[11]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_B[7]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_B[27]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_A[12]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_A[28]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheAddressIn_A[4]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_A[8]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_B[12]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheAddressIn_B[4]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_B[8]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_B[28]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_A[13]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_A[20]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_A[29]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_A[0]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheAddressIn_A[5]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_A[9]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_B[0]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheAddressIn_B[5]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_B[20]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_B[13]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_B[9]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_B[29]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_A[14]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_A[21]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_A[1]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheAddressIn_A[6]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_B[1]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheAddressIn_B[6]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_B[21]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_B[14]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_A[15]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_A[22]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_A[2]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheAddressIn_A[7]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_B[2]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_B[22]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_B[15]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheAddressIn_B[7]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_A[16]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_A[23]}]
set_input_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataIn_A[30]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_B[1]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_B[14]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_B[21]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_A[22]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_A[15]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_B[10]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_A[6]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_A[11]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {portA_writtenTo}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_B[6]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_B[19]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_B[26]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_A[27]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_A[2]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_B[2]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_B[15]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_B[22]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_A[30]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_A[23]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_A[16]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {portB_writtenTo}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_B[11]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_A[12]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_A[7]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_B[7]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_B[27]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_A[28]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_A[3]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_B[3]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_B[16]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_B[23]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_B[30]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_A[31]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_A[24]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_A[17]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_B[12]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_A[8]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_A[20]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_A[13]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_B[8]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_A[29]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_A[4]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_B[28]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_B[4]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_B[17]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_B[24]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_A[25]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_A[18]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_A[0]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_B[31]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_B[0]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_B[13]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_B[20]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_A[21]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_A[14]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_A[9]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_B[9]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_B[29]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_A[5]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_A[10]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_B[5]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_B[18]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_B[25]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_A[26]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_A[19]}]
set_output_delay -add_delay 0.05 -clock [get_clocks {clk}] [get_ports {cacheDataOut_A[1]}]
set_clock_uncertainty 0 [get_clocks {clk}]
